[
{
	"question": "What uses Server?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Server>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What updates Case?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Case>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses IuKDG?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/IuKDG>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Quality?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Quality>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses KHStatV?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/KhStatV>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What updates Bill?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Bill>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What updates DRG?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Drg>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Standard?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Standard>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Laundry?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Laundry>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Project?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Project>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses BDSG?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Bdsg>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Food?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Food>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Backbone?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Backbone>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What updates Bed?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Bed>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses ISO 9001?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ISO9001>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Resource?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Resource>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Bed?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Bed>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Patient?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Patient>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Order?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Order>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Case?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Case>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What updates Food?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Food>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Service?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Service>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses ITIL?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Itil>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Law?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Law>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What updates Order?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Order>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Transfer?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Transfer>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Material?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Material>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Network?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Network>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses BPflV?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/BPflV>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses Bill?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Bill>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses KHRG?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Khrg>. }",
	"language": "en",
	"id": -1
},
{
	"question": "What uses SGB V?",
	"sparql": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Sgbv>. }",
	"language": "en",
	"id": -1
}
]
