%*****************************************
\chapter{Ausführung der Lösung}\label{ch:solution}
%*****************************************

\section{Erstellung des Benchmarks}

Zur Erstellung eines Benchmarks braucht es zwei Dinge:
Natürlichsprachige Fragen und die Antworten als \ac{sparql}-Abfrage.
Der Ansatz, um die Fragen zu erhalten, ist, die bereits durch \citet{arneba} klassifizierten Fragen aus \citet{bb} zu verwenden.
Diese wurden jedoch für ein Quiz auf Basis von \ac{snik} klassifiziert, weshalb wir nun neue Kriterien benötigen.

Die Fragen müssen durch eine SPARQL-Query abfragbar sein, dass heißt die möglichen Antworttypen sind Mengen an Ressourcen mit mindestens null Elementen, Literale und einen Wahrheitswert,
der sich bei affirmativen Fragen auf die Existenz der Menge oder ihrer Elemente bezieht.
Nicht abfragbar sind jedoch Größe die Menge, dies ist pädagogisch nicht sinnvoll, da die Ontologie unvollständig sein könnte.
Nach der \emph{open world assumption} ist nicht sämtliches existierendes Wissen in SNIK vorhanden, es ist also nur ein Teil des Existenten in der Ontologie.
Wenn beispielsweise nach der Anzahl unterschiedlicher Arten von Architekturen von Informationssystemen im Gesundheitswesen gefragt würde, sollte das System \enquote{zwei} antworten.
Es könnte jedoch noch mehr geben, weshalb solche Fragen nicht unterstützt werden sollen.
Des Weiteren sollen keine Aggregate, also Operationen wie Summe, Durchschnitt, o.ä. abfragbar sein, da \ac{snik} keine statistischen Daten enthält.
So ergeben solche Fragen aber keinen Sinn.
Zuletzt soll \ac{snik} auch nicht Sachverhalte erklären können, auch, weil nach dem aktuellen Forschungsstand solches nicht möglich ist.
Dafür bräuchte man eine künstliche Intelligenz, welche Sachverhalte verstehen und in eigenen Worten wiedergeben kann.
Außerdem ist das nicht das Ziel dieser Arbeit.
Darauf basierend ist feststellbar, dass nur faktische Fragen beantwortbar sein sollen, also Fragen, die mit Fakten beantwortet werden.
Andere Fragetypen sind solche wie temporale Fragen, welche sich mit Zeitwerten befassen, solche gibt es in \ac{snik} jedoch nicht.
Prozedurale Fragen, meist, aber nicht immer, erkennbar am Schlüsselwort \enquote{wie}.
Sie erhalten Prozesse oder Erklärungen von Schrittabfolgen als Antworten.
Sie sind, genau wie kausale Fragen, welche mit einem Grund o.ä. beantwortet werden, aus den Tripeln schlecht ableitbar.
Kausale Fragen haben oft das Fragewort \enquote{Warum}.
Geographische Fragen sind, wie temporale Fragen, sinnlos, da solche Daten hier nicht gespeichert werden.
Häufige Fragen sind auch Vergleiche, oder auch evaluierende Fragen.
Hier sollen Gemeinsamkeiten und Unterschiede festzustellen.
Man kann sie also als zusammengesetzte Frage aus drei Teilfragen verstehen.
Angenommen man soll zwei fiktive Ressourcen \texttt{?x} und \texttt{?y} vergleichen.
\begin{lstlisting}[language=SPARQL]
SELECT *
WHERE
  { ?x ?p ?o
    ?y ?p ?o . }
\end{lstlisting}
Sei die Menge $E$ wie folgt definiert:
$E(s) = \{(p,o) \in KB | (s,p,o) \in KB\}$.
Sie enthält also, abhängig vom Subjekt $s$, die geordnete Menge $(p,o)$ aus Objekt und Prädikat.
Diese sind Element der Wissensbasis, sowohl als Paar als auch als Tripel.
Folgende Mengenoperationen müssten ausgeführt werden, um die Gemeinsamkeiten und Unterschiede einzeln zu betrachten:
\begin{align*}
E(x) &\cap E(y) \\
E(x) &\setminus E(y) \\
E(y) &\setminus E(x)
\end{align*}
Dies ist, weil es eine zusammengesetzte Frage ist und der Komplexität einer solchen Operation im Allgemeinen, noch nicht möglich.
Das Metamodell \ac{snik}s stellt die Aufgabe der Ontologie gut dar: \emph{Wer} macht \emph{was} und \emph{womit}, nicht \emph{warum}, \emph{wann} oder \emph{wie}.

Das System soll nach \cref{def:efrage} und \cref{def:kfrage} simple und komplexe Fragen beantworten können, oder zumindest mit ihnen trainiert werden.
Es soll jedoch keine zusammengesetzten Fragen nach \cref{def:zfrage} beantworten können, da die einerseits oft in mehrere Unterfragen aufgespalten werden können
und andererseits nur schwer beantwortbar sind.
Letztlich ist auch anzumerken, dass nur Fragen aus \ac{afb} 1 \citep{afb}, und auch bei diesen nur ein Teil, beantwortet werden können.
Unter diesen fallen Operatoren wie \enquote{angeben} oder \enquote{aufzählen}.

\subsection{Klassifizierung der Fragen}\label{sub:fragenklassifikation}

Nun sollen die Fragen aus \citet{bb} einzeln nach Fragetyp und -art, welche oben erklärt wurden, klassifiziert werden.
Sie wurden von \citet{arneba} bereits für das Quiz eingeordnet, in der Tabelle als \enquote{Original} erkennbar.
Hier werden sie erneut eingeordnet, Unterschiede sind \textbf{fett} gedruckt.
Hier wird eine Frage als geeignet eingestuft, wenn sie faktisch und simpel oder komplex, nicht aber zusammengesetzt sind.
Außerdem wird den Fragen eine ID gegeben, welche aus Kapitelnummer und einer fortlaufenden Zahl gebildet wird.

\begin{longtable}{c p{6.5 cm} c c c c}
  \caption[Fragenklassifikation]{Klassifizierung der Fragen aus \citet{bb} basierend auf \citet{arneba}.
  Fett: Unterschiedliche Klassifizierung bezüglich der Eignung.
  Komma bei Frageart: Teilfragen haben unterschiedliche Frageart.
  Fragetyp und -art nach Anfangsbuchstaben abgekürzt.}
  \endfirsthead
  \label{tab:fragenklassifikation}
  \\
  \toprule
  \rot{\textnormal{Kapitel/ID}}&\rot{\textnormal{Frage}}&\rot{\textnormal{Fragetyp}}&\rot{\textnormal{Frageart}}&\rot{\textnormal{Eignung}}&\rot{\textnormal{Orginal}} \\
  \midrule \\
  \endhead
  1/1 & Why is systematic information processing in health care institutions important? & K & S & \xmark & \xmark \\
  1/2 & What are appropriate models for health information systems? & F & S & \cmark & \cmark \\
  1/3 & How do health information systems look like and what architectures are appropriate? & P, F & Z & \xmark & \xmark \\
  1/4 & How can we assess the quality of health information systems? & P & S & \xmark & \xmark \\
  1/5 & How can we strategically manage health information systems? & P & S & \xmark & \xmark \\
  1/6 & How can good information systems be designed and maintained? & P & S & \xmark & \xmark \\
  2/1 & What is the significance of information systems for health care? & K & S & \xmark & \xmark \\
  2/2 & How does technical progress affect health care? & P & S & \xmark & \xmark \\
  2/3 & Why is systematic information management important? & K & S & \xmark & \xmark \\
  3/1 & What is the difference between data, information and knowledge? & V & Z & \xmark & \xmark \\
  3/2 & What are information systems, and what are their components? & F & Z & \xmark & \xmark \\
  3/3 & What is information management? & F & S & \cmark & \cmark \\
  4/1 & What are hospital information systems? & F & S & \cmark & \cmark \\
  4/2 & What are transinstitutional health information systems? & F & S & \cmark & \cmark \\
  4/3 & What are challenges for health information systems? & F & S & \cmark & \cmark \\
  4/4 & What are electronic health records? & F & S & \cmark & \cmark \\
  5/1 & What are models, metamodels and reference models? & F & Z & \xmark & \xmark \\
  5/2 & What are typical metamodels for modeling various aspects of HIS? & F & S & \cmark & \cmark \\
  5/3 & What is 3LGM$^2$? & F & S & \cmark & \cmark \\
  5/4 & What are typical reference models for HIS? & F & S & \cmark & \cmark \\
  6/1 & What kind of data has to be processed in hospitals? & F & S & \cmark & \cmark \\
  6/2 & What are the main hospital functions? & F & S & \cmark & \cmark \\
  6/3 & What are the typical information processing tools in hospitals? & F & S & \cmark & \cmark \\
  6/4 & What are different architectures of HIS? & F & S & \cmark & \cmark \\
  6/5 & How can integrity and integration be achieved within HIS? & P & S & \xmark & \xmark \\
  6.4/1 & What application components are used in hospitals, and what are their characteristics? & F & Z & \xmark & \xmark \\
  \textbf{6.5/1} & \textbf{How can architectures of HIS be categorized?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  6.5/2 & What differs integrity from integration? & V & Z & \xmark & \xmark \\
  \textbf{6.5/3} & \textbf{What standards and technologies are available to support integration of HIS?} & \textbf{F} & \textbf{Z} & \xmark & \cmark \\
  6.5/4 & How can integration efforts be reduced by decreasing the variety of application components in a HIS? & P & K & \xmark & \xmark \\
  6.6/1 & What computer-based and non-computer-based physical data processing systems can be found in hospitals? & F & Z & \xmark & \xmark \\
  6.6/2 & What is meant by the term \enquote{infrastructure}? & F & S & \cmark & \cmark \\
  6.7/1 & How can physical data processing systems be grouped and arranged in order to support application components in an optimal way? What architectures can this result? & P, F & Z & \xmark & \xmark \\
  6.7/2 & What is meant by physical integration? & F & S & \cmark & \cmark \\
  6.7/3 & How do modern computing centers look like? & P & S & \xmark & \xmark \\
  7/1 & How do architectures of transinstitutional health information systems differ from those of hospital information systems? & V & Z & \xmark & \xmark \\
  7/2 & What additional challenges do we have to cope with? & F & S & \xmark & \xmark \\
  \textbf{7/3} & \textbf{Which strategies are appropriate for maintaining electronic health records in a transinstitutional health information system?} & \textbf{F} & \textbf{K} & \cmark & \xmark \\
  8/1 & Which facets of quality have to be considered in HIS? & F & S & \cmark & \cmark \\
  \textbf{8/2} & \textbf{What are the characteristics of the quality of structures in HIS?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  \textbf{8/3} & \textbf{What are the characteristics of the quality of processes of HIS?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  \textbf{8/4} & \textbf{What are the characteristics of quality of outcome of HIS?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  8/5 & What does information management have to balance in order to increase the quality of a HIS? & K & S & \xmark & \xmark \\
  \textbf{8/6} & \textbf{How can quality of HIS be evaluated?} & \textbf{F} & \textbf{K} & \cmark & \xmark \\
  \textbf{8.2/1} & \textbf{What criteria for quality of data exist?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  8.2/2 & What criteria for computer-based application components and physical data processing systems exist? & F & Z & \xmark & \xmark \\
  \textbf{8.2/3} & \textbf{What criteria for the overall HIS architecture exist?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  \textbf{8.3/1} & \textbf{What are the characteristics of the quality of processes of HIS?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  \textbf{8.4/1} & \textbf{What are the characteristics of quality of outcome of HIS especially in hospitals?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  8.5/1 & What does information management have to balance in order to increase the quality of health information systems? & K & S & \xmark & \xmark \\
  \textbf{8.6/1} & \textbf{What are major phases of an IT evaluation study?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  \textbf{8.6/2} & \textbf{What are major IT evaluation methods?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  9/1 & What does information management mean and how can strategic, tactical and operational information management be differentiated? & F, V & Z & \xmark & \xmark \\
  \textbf{9/2} & \textbf{What organizational structures are appropriate for information management in hospitals?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  \textbf{9/3} & \textbf{What are the tasks and methods for strategic HIS planning?} & \textbf{F} & \textbf{K} & \cmark & \xmark \\
  \textbf{9/4} & \textbf{What are the tasks and methods for strategic HIS monitoring?} & \textbf{F} & \textbf{K} & \cmark & \xmark \\
  \textbf{9/5} & \textbf{W  hat are the tasks and methods for strategic HIS directing?} & \textbf{F} & \textbf{K} & \cmark & \xmark \\
  9/6 & How can experts for information management in hospitals be gained? & P & S & \xmark & \xmark \\
  9.2/1 & What does information management in general and in hospitals encompass? & K & K & \xmark & \xmark \\
  9.2/2 & What are the three main scopes of information management? & F & K & \cmark & \cmark \\
  9.2/3 & What are the tasks of strategic, tactical and operational information management in hospitals? & F & Z & \xmark & \xmark \\
  9.2/4 & What is meant by IT service management and how is it related to information management? & F & Z & \xmark & \xmark \\
  9.3.4.2/1 & Which organizational units are involved in information management? & F & K & \cmark & \cmark \\
  9.3.4.2/2 & Which boards and persons are involved in information management? & F & section & \cmark & \cmark \\
  9.3.4.2/3 & Who is responsible for strategic information management? & F & S & \cmark & \cmark \\
  9.3.4.2/4 & Who is responsible for tactical information management? & F & S & \cmark & \cmark \\
  9.3.4.2/5 & Who is responsible for operational information management? & F & S & \cmark & \cmark \\
  9.3.4.2/6 & Who is the CIO, and what is his or her responsibility? & F & Z & \xmark & \xmark \\
  9.4/1 & What are the typical tasks for strategic HIS planning? & F & K & \cmark & \cmark \\
  9.4/2 & What are the typical methods for strategic HIS planning? & F & K & \cmark & \cmark \\
  9.4/3 & What is the goal and typical structure of a strategic information management plan? & F & Z & \xmark & \xmark \\
  9.5/1 & What are the typical tasks of strategic HIS monitoring? & F & S & \cmark & \cmark \\
  9.5/2 & What are the typical methods of strategic HIS monitoring? & F & S & \cmark & \cmark \\
  9.6/1 & What are the typical tasks of strategic HIS directing? & F & S & \cmark & \cmark \\
  9.6/2 & What are the typical methods of strategic HIS directing? & K & S & \cmark & \cmark \\
  10/1 & What are health care networks? & F & S & \cmark & \cmark \\
  \textbf{10/2} & \textbf{How can health care networks be described?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  \textbf{10/3} & \textbf{What organizational structures are appropriate for information management in health care networks?} & \textbf{F} & \textbf{S} & \cmark & \xmark \\
  10/4 & How can good information systems be maintained? & P & S & \xmark & \xmark \\

  \bottomrule \\
\end{longtable}

Hier wurden insgesamt 47 der 79 Fragen als geeignet befunden, verglichen mit 30 vorher.
Dies beruht größtenteils auf zwei Gründen:
\begin{enumerate}
  \item Den Unterschieden zwischen dem Stellen von Fragen in Form eines Quizzes und der Fragenbeantwortung und
  \item fälschlicher Einordnung einzelner Fragen mit dem Fragewort \enquote{how} als prozedural.
\end{enumerate}
Ersteres ist beispielsweise bei den Fragen \texttt{6.6/1}, \texttt{8.6/1} oder \texttt{9/2} der Fall.
Häufig wurden nach \cref{def:kfrage} komplexe Fragen aussortiert, besonders bei Einschränkungen, wie etwa Frage \texttt{7/3}.
Die vermutlich fälschliche Einordnung liegt bei \texttt{6.5/1}, \texttt{8/6} oder \texttt{10/2} vor.
Jedoch können von den initial als geeignet befundenen Fragen nicht alle verwendet werden, da einige nicht in der Ontologie modelliert sind.
Diese sind \texttt{4/3}, \texttt{6/1}, \texttt{8/4}, \texttt{8.4/1} und \texttt{9/2} sowie \texttt{9.3.4.2/3} bis \texttt{9.3.4.2/5}, \texttt{9.4/1} und \texttt{10/3}.
Somit verbleiben letztendlich 37 Fragen, welche im Folgenden in \ac{sparql}-Abfragen umgewandelt werden.

\subsection[Formulierung der SPARQL-Abfragen]{Formulierung der \ac{sparql}-Abfragen}

Aus den in \cref{sub:fragenklassifikation} ausgewählten Fragen werden nun \ac{sparql}-Abfragen gebildet.

\begin{lstlisting}[language=SPARQL]
# 1/2 What are appropriate models for health information systems?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf+ bb:Model . }

# 3/3 What is information management?
SELECT DISTINCT ?o1
WHERE
  { bb:InformationManagement skos:definition ?o1 . }

# 4/1 What are hospital information systems?
SELECT DISTINCT ?o1
WHERE
  { bb:HospitalInformationSystem skos:definition ?o1 . }

# 4/2 What are transinstitutional health information systems?
SELECT DISTINCT ?o1
WHERE
  { bb:TransinstitutionalHealthInformationSystem skos:definition ?o1 . }

# 4/4 What are electronic health records?
SELECT DISTINCT ?o1
WHERE
  { bb:ElectronicHealthRecord skos:definition ?o1 . }

# 5/2 What are typical metamodels for modeling various aspects of HIS?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf+ bb:Metamodel . }

# 5/3 What is 3LGM2?
SELECT DISTINCT ?o1
WHERE
  { bb:3LMG2 skos:definition ?o1 . }

# 5/4 What are typical reference models for HIS?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf+ bb:ReferenceModel . }

# 6/2 What are the main hospital functions?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf bb:HospitalFunction . }

# 6/3 What are typical information processing tools in hospitals?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf+ bb:InformationProcessingTool . }

# 6/4 What are different architectures of HIS?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf+ bb:HisArchitecture . }

# 6.5/1 How can architectures of HIS be categorized?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf+ bb:HisArchitecture . }

# 6.6/2 What is meant by the term "infrastructure"?
SELECT DISTINCT ?o1
WHERE
  { bb:HisInfrastructure skos:definition ?o1 . }

# 6.7/2 What is meant by physical integration?
SELECT DISTINCT ?o1
WHERE
  { bb:PhysicalIntegration skos:definition ?o1 . }

# 7/3 Which strategies are appropriate for maintaining electronic health records in a transinstitutional health information system?
SELECT DISTINCT ?o1
WHERE
  { bb:TransinstitutionalHealthInformationSystem meta:isAssociatedWith ?o1 . }

# 8/1 Which facets of quality have to be considered in HIS?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:entityTypeComponent bb:HisQuality . }

# 8/2 What are the characteristics of the quality of structures in HIS?
SELECT DISTINCT ?s2
WHERE
  { bb:QualityOfHISStructures meta:entityTypeComponent ?o1 .
    ?s2 rdfs:subClassOf ?o1 . }

# 8/3 What are the characteristics of  the quality of processes of HIS?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf bb:QualityOfHISProcesses . }

# 8/6 How can quality of HIS be evaluated?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf bb:EvaluationMethod .
    ?s1 meta:isAssociatedWith bb:HisQuality . }

# 8.2/1 What criteria for quality of data exist?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf bb:QualityOfData . }

# 8.2/3 What criteria for the overall HIS architecture exist?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf bb:QualityOfHISArchitecture . }

# 8.3/1 What are the characteristics of the quality of processes of HIS?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf bb:QualityOfHISProcesses . }

# 8.6/1 What are major phases of an IT evaluation study?
SELECT DISTINCT ?s1
WHERE
  { ?s1 meta:updates bb:ItEvaluationStudy . }

# 8.6/2 What are major IT evaluation methods?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf bb:EvaluationMethod . }

# 9/3 What are the tasks and methods for strategic HIS planning?
SELECT DISTINCT ?o1
WHERE
  { bb:StrategicHISPlanning meta:updates | meta:functionComponent ?o1 . }

# 9/4 What are the tasks and methods for strategic HIS monitoring?
SELECT DISTINCT ?o1
WHERE
  { bb:StrategicHISMonitoring meta:updates | meta:functionComponent ?o1 . }

# 9/5 What are the tasks and methods for strategic HIS directing?
SELECT DISTINCT ?o1
WHERE
  { bb:StrategicHISDirecting meta:updates | meta:functionComponent ?o1 . }

# 9.2/2 What are the three main scopes of information management?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf bb:InformationManagement . }
LIMIT 3

# 9.3.4.2/1 Which organizational units are involved in information management?
SELECT DISTINCT ?s1
WHERE
  { ?s1 meta:functionComponent bb:InformationManagement . }

# 9.3.4.2/2 Which boards and persons are involved in information management?
SELECT DISTINCT ?s1
WHERE
  { ?s1 meta:isResponsibleForFunction bb:InformationManagement . }

# 9.4/2 What are the typical tasks for strategic HIS planning?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf bb:StrategicHISPlanning . }

# 9.5/1 What are the typical tasks of strategic HIS monitoring?
SELECT DISTINCT ?s1
WHERE
  { ?s1 rdfs:subClassOf bb:StrategicHISMonitoring . }

# 9.5/2 What are the typical methods of strategic HIS monitoring?
SELECT DISTINCT ?o1
WHERE
  { bb:StrategicHISMonitoring meta:functionComponent ?o1 . }

# 9.6/1 What are the typical tasks of strategic HIS directing?
SELECT DISTINCT ?o1
WHERE
  { bb:StrategicHISDirecting meta:uses ?o1 . }

# 9.6/2 What are the typical methods of strategic HIS directing?
SELECT DISTINCT ?o1
WHERE
  { bb:StrategicHISDirecting meta:functionComponent ?o1 . }

# 10/1 What are health care networks?
SELECT DISTINCT ?o1
WHERE
  { bb:HealthCareNetwork skos:definition ?o1 . }

# 10/2 How can health care networks be described?
SELECT DISTINCT ?o1
WHERE
  { bb:HealthCareNetwork skos:definition ?o1 . }

\end{lstlisting}

\section{Auswahl eines Kandidaten}

Die Auswahl eines oder mehrerer Kandidaten gestaltete sich aufgrund von nicht instand gehaltener Programme
und der Spezialisierung von vielen Systemen auf DBpedia oder ähnlichen Wissensbasen sehr schwierig.
Bei gAnswer2 war es beispielsweise nicht möglich, überhaupt ein Programm, was man hätte ausprobieren können, zu finden,
bei gAnswer war die Vorbereitung der Daten sehr aufwändig und die gegebenen Werkzeuge kaputt.
DeepPavlov war am Anfang sehr vielversprechend, besonders aufgrund des modularen Aufbaus.
Jedoch gab es keine Möglichkeit, andere Daten als Wikidata zu verwenden, weshalb es für den Einsatz mit \ac{snik} wenig hilfreich ist.
Ähnlich sieht es mit AskNow aus, wo aufgrund des Entity Linkings DBpedia verwendet werden muss.
In der Dokumentation\footnote{\url{http://docs.deeppavlov.ai/en/master/features/models/kbqa.html}, abgerufen am 9. Mai 2022} wird allerdings geschrieben,
dass in der Zukunft auch die Verwendung anderer Quellen möglich sein sollen.
All diese und andere Probleme beschrieb bereits \citet{diefenbachkbqa}.
Er nannte speziell die Probleme der
\begin{itemize}
  \item Mehrsprachigkeit,
  \item Portabilität,
  \item Skalierbarkeit,
  \item Robustheit,
  \item Fähigkeit, über mehrere Dateien zu suchen und
  \item Präsentation der Antwort.
\end{itemize}
Hier waren vor allem die Portabilität und Robustheit, aber auch teilweise die Präsentation der Antwort problematisch.

\subsection{TeBaQA}

TeBaQA war anfangs sehr vielversprechend, mehr noch als DeepPavlov.
Es sollte die Verwendung von eigenen \ac{rdf}-Tripeln ermöglichen, indem man die \texttt{indexing.properties}-Datei so verändert, dass die eigene Ontologie verwendet wird.
Es gab zwei Ordner, einen namens \texttt{ontology} und einen namens \texttt{data}.
Da \ac{snik}, wie in \cref{sec:snik} schon erwähnt, eine Ontologien aus Ontologien ist, kam in den \texttt{ontology}-Ordner nur die \texttt{meta.ttl}, wo die Properties gespeichert sind.
Die restlichen Tripel kamen alle in den \texttt{data}-Ordner, da es TeBaQA auch möglich sein sollte, mehrere Dateien als Quelle zu verwenden.
Die auf \texttt{.flag} endenden Variablen wurden auf \texttt{true} gesetzt.
Andere Dateien wurden nicht verändert.

Leider warf das System immer wieder Fehler bezüglich der ElasticSearch-Konfiguration, weshalb wir ein Docker-Image,
also quasi eine auf Anwendungsebene virtuelle Umgebung, mit ElasticSearch 6.6.1, TeBaQA und der \ac{snik}-Ontologie erstellt habe.
Diese war zusätzlich noch ein weiteres Mal darin, da es Probleme mit der Reihenfolge des Ladens der Daten gab.
Letztendlich konnten wir aber nicht alle Probleme und Fehler beheben, da es immer wieder zu Laufzeitfehlern kam.
Es wurden werde \ac{sparql}-Abfragen noch Ergebnisse angezeigt.

\subsection{QAnswer KG}

QAnswer KG präsentierte sich als einfache Methode, mithilfe von eigenen Daten Question Answering zu betreiben.
Es funktioniert, indem man auf der Website\footnote{\url{https://qanswer-frontend.univ-st-etienne.fr/}} einen Account erstellt und in diesem seine Daten hochlädt.
Auf der Startseite ist bereits ein Beispiel mit Wikidata vorhanden.

\subsubsection{Anfängliche Konfiguration und Probleme}

Beim Einrichten der Umgebung wurde die Sprache auf Englisch gestellt, da in dieser auch die Fragen beantwortet werden sollen.
QAnswer KG versucht, sich auf eine Antwort zu konzentrieren und stellt nur die als am besten bewertete \ac{sparql}-Abfrage dar.
Hier wird das Problem der Ambiguität deutlich, da bei der Frage \enquote{What is the chief information officer responsible for?} sowohl
\aurl{meta}{isResponsibleForEntityType}, \aurl{meta}{isResponsibleForFunction} und \aurl{meta}{isResponsibleForRole} gemeint sein könnten.
Der Ansatz für die Lösung dises Problems war es, im Training in den als Lösung markierten \ac{sparql}-Abfragen \emph{property paths} zu verwenden,
mit denen man zum Beispiel das Prädikat unterschiedliche Ressourcen sein lassen kann.
Es werden letztendlich drei Abfragen ausgeführt, eine für jede mögliche Kombination der Attribute, also hier einmal pro Prädikat.
Statt etwa \texttt{meta:isResponsibleForEntityType} stünde nun \texttt{meta:isResponsibleForRole|meta:isResponsibleForFunction|meta:isResponsibleForRole} dort.
Praktisch für die Lokalisierung der Fehler war die Funktion, sich alle generierten Anfragen anzeigen zu lassen.
Somit konnte erahnt werden, warum es das macht, was es macht.

Wenn keine Lösung für die Frage gefunden wurde, gab es als Ausgabe meist die Ressource selbst, also zum Beispiel \aurl{bb}{ChiefInformationOfficer}.
Dies kann zwar nützlich, aber auch verwirrend sein und sollte mithilfe von Training verhindert werden.
Die Präzision der Ergebnisse ohne jegliches fine-tuning ist aber trotzdem erstaunlich.

Mit der Konfiguration an sich konnten auch schon viele Fehler behoben werden.
So gibt es eine Liste von \enquote{stop words}, welche nicht betrachtet werden.
Unter diesen sind häufig verwendete Präpositionen, Konjunktionen, Verben oder Füllwörter wie \enquote{and} oder \enquote{many}.
Diese sollen verhindern, dass falsche Ressourcen gefunden werden.
Hier musste diese Liste allerdings so modifiziert werden, dass das Wort \texttt{for} nicht mehr darin vorkommt, denn ohne es können Prädikate wie \enquote{responsible for} schwer erkannt werden,
besonders, da die beiden Wörter oft getrennt im Satz vorkommen.
Entfernt wurden auch \texttt{define} und \texttt{describe}.\todo{Auch in QAnswer machen?}
Somit verblieben dann folgende Wörter in der Liste der Stopp-Wörter:
\texttt{a}, \texttt{about}, \texttt{all}, \texttt{an}, \texttt{and}, \texttt{are}, \texttt{as}, \texttt{at}, \texttt{be}, \texttt{by}, \texttt{can}, \texttt{did}, \texttt{do}, \texttt{does}, \texttt{from}, \texttt{give}, \texttt{goes}, \texttt{had}, \texttt{has}, \texttt{have}, \texttt{here}, \texttt{how}, \texttt{in}, \texttt{into}, \texttt{is}, \texttt{its}, \texttt{list}, \texttt{many}, \texttt{most}, \texttt{my}, \texttt{no}, \texttt{of}, \texttt{on}, \texttt{or}, \texttt{s}, \texttt{show}, \texttt{some}, \texttt{something}, \texttt{such}, \texttt{tell}, \texttt{the}, \texttt{their}, \texttt{these}, \texttt{they}, \texttt{this}, \texttt{to}, \texttt{using}, \texttt{was}, \texttt{were}, \texttt{what}, \texttt{which}, \texttt{will}, \texttt{with}, \texttt{yes}

Aus den \emph{Hidden Properties} wurde \aurl{rdfs}{subClassOf} hinzugefügt.
Hidden Properties sind solche, die nicht explizit in der Frage benutzt werden, aber trotzdem gemeint werden können.
Es wurde \aurl{skos}{altLabel} als weiteres Label für Ressourcen hinzugefügt, sodass QAnswer auch diese beachtet.
Die Mappings mussten auch dahingehend verändert werden, als dass \texttt{skos}{definition}
und \texttt{rdfs}{comment} als Beschreibung hinzugefügt wurden.
Die Definition wurde auch bei den Ergebnissen angezeigt, sodass es bei Ergebnissen von Fragen nach der Definition als richtig erachtet wurde, wenn die zu definierende Ressource richtig erkannt wurde.

Es gibt auch die Möglichkeit, direkt Wörter als Aliase für \acp{uri} zu nutzen.
Bei den \emph{Property Mapping} können \acp{uri} und dafür stehende Lexikalisierungen in Abhängigkeit gebracht werden, wie bei einem Wörterbuch.
Dies wurde hier für \emph{phases} und \emph{tasks} bei \aurl{meta}{updates} gemacht.

\subsubsection{Training}

Das Fragenset wurde in zwei Hälften geteilt, eine zum Training und eine zum Testen.
Vor dem Training wurde der Testdatensatz verwendet, um die Leistung des Systems vor und nach dem Training vergleichen zu können.
Siehe hierzu \cref{tab:qanswervortraining}.
Die Fragen wurden randomisiert in die Gruppen eingeteilt, sodass 19 im Trainingsdatensatz und 18 im Testdatensatz sind.

\begin{longtable}{r c c c c c c c}
  \caption[Testdatensatz QAnswer vor Training]{Testdatensatz auf QAnswer KG vor dem Training.
  Conf.: QAnswer \emph{Confidence}-Wert}
  \label{tab:qanswervortraining}
  \endfirsthead
  \\
  \toprule
  Kapitel/ID    & Conf. & |O|   & |C|   & $|O \cap C|$  & P     & R     & F-Maß   \\
  \midrule \\
  \endhead
  1/2           & 0.49  & 1     & 30    & 0             & 0     & 0     & 0       \\
  3/3           & 0.90  & 1     & 1     & 1             & 1     & 1     & 1       \\
  4/1           & 0.95  & 1     & 1     & 0             & 0     & 0     & 0       \\
  4/4           & 0.88  & 1     & 1     & 1             & 1     & 1     & 1       \\
  5/4           & 0.25  & 1     & 7     & 0             & 0     & 0     & 0       \\
  6/2           & 0.32  & 1     & 4     & 0             & 0     & 0     & 0       \\
  6/4           & 0.22  & 1     & 2     & 0             & 0     & 0     & 0       \\
  6.7/2         & 0.33  & 1     & 1     & 1             & 1     & 1     & 1       \\
  7/3           & 0.51  & 1     & 5     & 0             & 0     & 0     & 0       \\
  8.2/3         & 0.29  & 1     & 13    & 0             & 0     & 0     & 0       \\
  9/4           & 0.30  & 11    & 7     & 2             & 0.18  & 0.29  & 0.22    \\
  9/5           & 0.30  & 2     & 7     & 1             & 0.50  & 0.14  & 0.22    \\
  9.3.4.2/1     & 0.24  & 5     & 1     & 0             & 0     & 0     & 0       \\
  9.3.4.2/2     & 0.23  & 1     & 1     & 0             & 0     & 0     & 0       \\
  9.4/1         & 0.35  & 7     & 5     & 5             & 0.71  & 1     & 0.83    \\
  9.6/1         & 0.35  & 1     & 6     & 0             & 0     & 0     & 0       \\
  10/1          & 0.87  & 1     & 1     & 1             & 1     & 1     & 1       \\
  10/2          & 0.41  & 13    & 1     & 0             & 0     & 0     & 0       \\
  \midrule
  Durchschnitt  & 0.45  &       &       &               & 0.30  & 0.30  & 0.29    \\
  \bottomrule \\
\end{longtable}

Auffällig ist, dass nur Fragen nach der Definition richtig beantwortet wurden, diese aber konsistent.
Das liegt daran, dass QAnswer so konfiguriert ist, dass es immer die Definition der gefundenen Ressource mit anzeigt.
Bei Definitionsfragen wird die Ressource meist genannt und kann so gut vom System gefunden werden.
Die einzige Frage, wo dies nicht der Fall ist, ist \texttt{10/2}, wo das Kapitel, dass das Kapitel \enquote{Health Care Networks} fand.
