[{
	"question": "What is used by Appointment Scheduling?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AppointmentScheduling> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is used by Preparation of Health Statistics?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PreparationOfHealthStatistics> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What uses Information System Model?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/InformationSystemModel>. }"
},
{
	"question": "What is used by Performance of Legal Notification Requirements?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PerformanceOfLegalNotificationRequirements> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is updated by Tactical HIS Monitoring?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TacticalHISMonitoring> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of ITIL Service Lifecycle?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ItilServiceLifecycle> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What uses Case?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Case>. }"
},
{
	"question": "What has the component Data?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Data>. }"
},
{
	"question": "What has the component Information Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/InformationManagement>. }"
},
{
	"question": "What updates Information System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/InformationSystem>. }"
},
{
	"question": "What has the component Nursing Problem?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/NursingProblem>. }"
},
{
	"question": "What uses Controlling Report?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ControllingReport>. }"
},
{
	"question": "What are components of OpenEHR Ontology?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OpenEHROntology> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What uses Admission Diagnosis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/AdmissionDiagnosis>. }"
},
{
	"question": "What has the component Systems Review?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/SystemsReview>. }"
},
{
	"question": "Who is responsible for  Medical and Nursing Care Planning?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/MedicalAndNursingCarePlanning>. }"
},
{
	"question": "What is updated by Execution of an IT Evaluation Study?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ExecutionOfAnITEvaluationStudy> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What uses Migration Path?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/MigrationPath>. }"
},
{
	"question": "What has the component Updating the Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/UpdatingTheStrategicInformationManagementPlan>. }"
},
{
	"question": "What is Technical Model based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TechnicalModel> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What has the component General Practice?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/GeneralPractice>. }"
},
{
	"question": "What is 3LGMÂ² based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/3LGM2> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What has the component Vendor?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/Vendor>. }"
},
{
	"question": "Who is responsible for  CCOW Standard?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/CcowStandard>. }"
},
{
	"question": "What increases Quality of HIS Outcome?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/increases> <http://www.snik.eu/ontology/bb/QualityOfHISOutcome>. }"
},
{
	"question": "Who is responsible for  IT Support?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/ItSupport>. }"
},
{
	"question": "What is used by Execution of Clinical Trials and Experiments?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ExecutionOfClinicalTrialsAndExperiments> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is used by Strategic HIS Monitoring?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicHISMonitoring> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What updates Annual IT Budget?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/AnnualITBudget>. }"
},
{
	"question": "What uses Health Insurance Portability and Accountability Act?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HealthInsurancePortabilityAndAccountabilityAct>. }"
},
{
	"question": "What has the component Planning of Finances?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PlanningOfFinances>. }"
},
{
	"question": "What is updated by Nursing Discharge and Nursing Report Writing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/NursingDischargeAndNursingReportWriting> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Human Resource Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/HumanResourceManagement>. }"
},
{
	"question": "What is CCHIT responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Cchit> <http://www.snik.eu/ontology/meta/isResponsibleForFunction> ?o. }"
},
{
	"question": "What are components of Patient Administration?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientAdministration> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What are components of Research and Education?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ResearchAndEducation> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What has the component Knowledge about Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Procedure>. }"
},
{
	"question": "What has the component Failure Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/FailureManagement>. }"
},
{
	"question": "What updates Food?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Food>. }"
},
{
	"question": "What is based on Logical Network Topology?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/LogicalNetworkTopology>. }"
},
{
	"question": "What are components of Functional Model?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FunctionalModel> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What uses Diagnostic Standard?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/DiagnosticStandard>. }"
},
{
	"question": "What has the component Deductive Approach?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DeductiveApproach>. }"
},
{
	"question": "What uses Service?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Service>. }"
},
{
	"question": "What has the component Deployment of Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/DeploymentOfStrategicInformationManagementPlan>. }"
},
{
	"question": "What has the component Study Participant?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/StudyParticipant>. }"
},
{
	"question": "What has the component Monitoring?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/Monitoring>. }"
},
{
	"question": "What has the component Durability?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Durability>. }"
},
{
	"question": "What uses Project Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ProjectPlan>. }"
},
{
	"question": "What has the component Approval to Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ApprovalToStrategicInformationManagementPlan>. }"
},
{
	"question": "What is used by Administrative Admission?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdministrativeAdmission> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Work Organization and Time Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/WorkOrganizationAndTimeManagement>. }"
},
{
	"question": "What uses Quality Report?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/QualityReport>. }"
},
{
	"question": "What is used by Medical Discharge and Medical Report Writing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MedicalDischargeAndMedicalReportWriting> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What are components of Hospital Information System?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HospitalInformationSystem> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is CEN responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Cen> <http://www.snik.eu/ontology/meta/isResponsibleForFunction> ?o. }"
},
{
	"question": "What has the component Pharmacy?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/Pharmacy>. }"
},
{
	"question": "What is used by Management of Medical Devices?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ManagementOfMedicalDevices> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is Operational Information Management Staff responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OperationalInformationManagementStaff> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "What are components of Information Management Board?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/InformationManagementBoard> <http://www.snik.eu/ontology/meta/roleComponent> ?o. }"
},
{
	"question": "What uses Hospital Business Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HospitalBusinessPlan>. }"
},
{
	"question": "What uses ITIL?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Itil>. }"
},
{
	"question": "What uses Law?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Law>. }"
},
{
	"question": "What updates Study Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/StudyPlan>. }"
},
{
	"question": "What is used by Hospital Billing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HospitalBilling> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is Hospital responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Hospital> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "What are components of Order?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Order> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of Strategic Information Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicInformationManagement> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What uses IT Evaluation Study?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ItEvaluationStudy>. }"
},
{
	"question": "What updates Knowledge about Therapeutic Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/TherapeuticProcedure>. }"
},
{
	"question": "What is updated by First Study Design?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FirstStudyDesign> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is updated by Modeling Hospital Information Systems?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ModelingHospitalInformationSystems> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What updates Nursing Report?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/NursingReport>. }"
},
{
	"question": "What are components of Medical Report?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MedicalReport> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Entity Type Relation Modeling Element?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/EntityTypeRelationModelingElement>. }"
},
{
	"question": "What updates Diagnosis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Diagnosis>. }"
},
{
	"question": "What is used by Establish and Promote the Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EstablishAndPromoteTheStrategicInformationManagementPlan> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Digital Image?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DigitalImage>. }"
},
{
	"question": "Who is responsible for  Trouble Shooting?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/TroubleShootingInItServiceManagement>. }"
},
{
	"question": "What has the component Statistical Evaluation of Patient Data?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/StatisticalEvaluationOfPatientData>. }"
},
{
	"question": "What has the component Execution of Clinical Trials and Experiments?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ExecutionOfClinicalTrialsAndExperiments>. }"
},
{
	"question": "What has the component Providing Customer-Centered Services?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ProvidingCustomerCenteredServices>. }"
},
{
	"question": "What uses Business Strategy?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/BusinessStrategy>. }"
},
{
	"question": "What updates Third-Party Fund?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ThirdPartyFund>. }"
},
{
	"question": "What has the component Chief Executive Officer?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/ChiefExecutiveOfficer>. }"
},
{
	"question": "Who is responsible for  Department of Information management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/InformationManagementDepartment>. }"
},
{
	"question": "What has the component Artificial System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ArtificialSystem>. }"
},
{
	"question": "What has the component Resource?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Resource>. }"
},
{
	"question": "What is used by Strategic Alignment?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicAlignment> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Administration of Business Trips and Further Training?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/AdministrationOfBusinessTripsAndFurtherTraining>. }"
},
{
	"question": "What are components of Patient Care Function?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientCare> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "Who is responsible for  DICOM Standard?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/DicomStandard>. }"
},
{
	"question": "What has the component OpenEHR Ontology?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/OpenEHROntology>. }"
},
{
	"question": "What has the component Medical Documentation System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/MedicalDocumentationSystem>. }"
},
{
	"question": "What is updated by Strategic Information Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicInformationManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component 3LGM² Data Transmission Connection?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2DataTransmissionConnection>. }"
},
{
	"question": "What is updated by Administration of Business Trips and Further Training?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdministrationOfBusinessTripsAndFurtherTraining> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of IT Service Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ItServiceManagement> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What has the component Patient Activity Level?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/PatientActivityLevel>. }"
},
{
	"question": "What is updated by Hospital Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HospitalManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is used by Administration and Allocation of Patient Records?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdministrationAndAllocationOfPatientRecords> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component 3LGM² Domain Layer?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2DomainLayer>. }"
},
{
	"question": "What is used by IT Service Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ItServiceManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is updated by Standardization by CEN?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StandardizationByCEN> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What uses Requirement of HIS Stakeholder?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/RequirementOfHISStakeholder>. }"
},
{
	"question": "What has the component Application Component?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ApplicationComponent>. }"
},
{
	"question": "What uses Reference Model for the Domain Layer of Hospital Information Systems?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ReferenceModelForTheDomainLayerOfHospitalInformationSystems>. }"
},
{
	"question": "What updates Strategic Goal of the Institution?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/StrategicGoalOfTheInstitution>. }"
},
{
	"question": "What has the component Hospital's Service?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HospitalService>. }"
},
{
	"question": "Who is responsible for  Visitor and Information Service?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/VisitorAndInformationService>. }"
},
{
	"question": "What is updated by Nursing Admission?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/NursingAdmission> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What uses Hospital Budget?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HospitalBudget>. }"
},
{
	"question": "What has the component Quality of HIS Architecture?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/QualityOfHISArchitecture>. }"
},
{
	"question": "What has the component First Study Design?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/FirstStudyDesign>. }"
},
{
	"question": "What is used by Modeling Hospital Information Systems?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ModelingHospitalInformationSystems> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component 3LGM²-S Providing Interface?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2SProvidingInterface>. }"
},
{
	"question": "What updates Strategic Decision?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/StrategicDecision>. }"
},
{
	"question": "What is CCOW responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Ccow> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "What has the component UML Class?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/UmlClass>. }"
},
{
	"question": "What updates Order?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Order>. }"
},
{
	"question": "What has the component Internal Quality Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/InternalQualityManagement>. }"
},
{
	"question": "What updates Enterprise Organizational Structure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/EnterpriseOrganizationalStructure>. }"
},
{
	"question": "What has the component Hospital Strategy?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HospitalStrategy>. }"
},
{
	"question": "What is used by Medical Care Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MedicalCarePlanning> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is used by Nursing Care Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/NursingCarePlanning> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is IT Evaluation Study based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ItEvaluationStudy> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What is based on Communication Protocol?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/CommunicationProtocol>. }"
},
{
	"question": "Who is responsible for  Discharge Summary?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/DischargeSummary>. }"
},
{
	"question": "What updates EuroRec EHR Quality Seal?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/EuroRecEHRQualitySeal>. }"
},
{
	"question": "What uses Patient Age?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/PatientAge>. }"
},
{
	"question": "What is used by Monitoring of National Legislation?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MonitoringOfNationalLegislation> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What are components of Quality of HIS Structures?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/QualityOfHISStructures> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is used by Nursing Admission?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/NursingAdmission> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is updated by Payroll Accounting?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PayrollAccounting> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Project Manager?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/ProjectManager>. }"
},
{
	"question": "What uses Medical Knowledge?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/MedicalKnowledge>. }"
},
{
	"question": "What are components of Quality Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/QualityManagement> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What has the component Sample?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Sample>. }"
},
{
	"question": "What has the component Informed Consent?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/InformedConsent>. }"
},
{
	"question": "What is based on Network Topology?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/NetworkTopology>. }"
},
{
	"question": "What decreases Data Collection Effort?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/decreases> <http://www.snik.eu/ontology/bb/DataCollectionEffort>. }"
},
{
	"question": "What updates Outpatient EHR Certification?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/OutpatientEHRCertification>. }"
},
{
	"question": "What has the component Strategic Information Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/StrategicInformationManagement>. }"
},
{
	"question": "Who is responsible for  Management of User Accounts?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/ManagementOfUserAccounts>. }"
},
{
	"question": "What has the component Planning of Buildings?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PlanningOfBuildings>. }"
},
{
	"question": "What has the component Enterprise Function Modeling Element?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/EnterpriseFunctionModelingElement>. }"
},
{
	"question": "What are components of Information and Communication Technology?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/InformationAndCommunicationTechnology> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of Strategic HIS Directing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicHISDirecting> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What has the component Patient Administration?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PatientAdministration>. }"
}]