[{
	"question": "What uses Study Design?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/StudyDesign>. }"
},
{
	"question": "What updates Medical and Nursing Knowledge?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/MedicalAndNursingKnowledge>. }"
},
{
	"question": "What updates Research Document?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ResearchDocument>. }"
},
{
	"question": "What updates Study Result?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/StudyResult>. }"
},
{
	"question": "What has the component Visitor and Information Service?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/VisitorAndInformationService>. }"
},
{
	"question": "What has the component Delivering of Customer-Centered Services?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/DeliveringOfCustomerCenteredServices>. }"
},
{
	"question": "What uses Strategic HIS Monitoring Result?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/StrategicHISMonitoringResult>. }"
},
{
	"question": "What has the component Hospital Information System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HospitalInformationSystem>. }"
},
{
	"question": "Who is responsible for  Third-Level Support?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/ThirdLevelSupport>. }"
},
{
	"question": "What are components of ISO 9241-110?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ISO9241110> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Service Asset Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ServiceAssetManagement>. }"
},
{
	"question": "What updates Nursing Care Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/NursingCarePlan>. }"
},
{
	"question": "What has the component Nursing Discharge and Nursing Report Writing?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/NursingDischargeAndNursingReportWriting>. }"
},
{
	"question": "Who is responsible for  Nursing Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/NursingProcedure>. }"
},
{
	"question": "Who is responsible for  Resource?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/Resource>. }"
},
{
	"question": "What has the component Physical Data Processing System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/PhysicalDataProcessingSystem>. }"
},
{
	"question": "What is used by Nursing Discharge and Nursing Report Writing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/NursingDischargeAndNursingReportWriting> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What decreases Transcription?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/decreases> <http://www.snik.eu/ontology/bb/Transcription>. }"
},
{
	"question": "What updates Clinical Pathway?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ClinicalPathway>. }"
},
{
	"question": "Who is responsible for  Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/StrategicInformationManagementPlan>. }"
},
{
	"question": "What are components of Financial Accounting?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FinancialAccounting> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is used by Execution of Nursing Procedures?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ExecutionOfNursingProcedures> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is Health Care Professional involved in?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HealthCareProfessional> <http://www.snik.eu/ontology/meta/isInvolvedIn> ?o. }"
},
{
	"question": "What has the component T3 Application Server?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/T3ApplicationServer>. }"
},
{
	"question": "What has the component Staff Controlling?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/StaffControlling>. }"
},
{
	"question": "What has the component Continuous HIS Auditing?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ContinuousHISAuditing>. }"
},
{
	"question": "What has the component HL7 Patient Identification?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HL7PatientIdentification>. }"
},
{
	"question": "Who is responsible for  Stability of Application Components?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/StabilityOfApplicationComponents>. }"
},
{
	"question": "What has the component Knowledge about Medical Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/MedicalProcedure>. }"
},
{
	"question": "What has the component Recommendations for Further Treatment?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/RecommendationsForFurtherTreatment>. }"
},
{
	"question": "What uses Server?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Server>. }"
},
{
	"question": "What are components of Study?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Study> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of IT Evaluation Study Management and Execution?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ItEvaluationStudyManagementAndExecution> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is used by Certification by CCHIT?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/CertificationByCCHIT> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Laundry Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/LaundryManagement>. }"
},
{
	"question": "What are components of System Introduction?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/SystemIntroduction> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is updated by Material and Medication Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MaterialAndMedicationManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is used by Medical Admission?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MedicalAdmission> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What updates Material?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Material>. }"
},
{
	"question": "What is Top Management responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TopManagement> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "Who is responsible for  Medical Admission?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/MedicalAdmission>. }"
},
{
	"question": "What is used by Order Entry?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OrderEntry> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is updated by Long Term Archiving?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/LongTermArchiving> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What updates Knowledge about Diagnostic Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/DiagnosticProcedure>. }"
},
{
	"question": "What is updated by Strategic HIS Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicHISPlanning> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Chief Financial Officer?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/ChiefFinancialOfficer>. }"
},
{
	"question": "What has the component Wound Care?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/WoundCare>. }"
},
{
	"question": "What is updated by Nursing Care Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/NursingCarePlanning> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Mixed Approach?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/MixedApproach>. }"
},
{
	"question": "What uses Key Performance Indicator?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/KeyPerformanceIndicator>. }"
},
{
	"question": "What updates Case?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Case>. }"
},
{
	"question": "What is used by Adoption of Project Result?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdoptionOfProjectResult> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Decision Making and Patient Information?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/DecisionMakingAndPatientInformation>. }"
},
{
	"question": "What has the component Knowledge Retrieval and Literature Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/KnowledgeRetrievalAndLiteratureManagement>. }"
},
{
	"question": "What is used by HIS Certification?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HisCertification> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is used by Laundry Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/LaundryManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What uses Malcolm Baldrige National Quality Award?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/MalcolmBaldrigeNationalQualityAward>. }"
},
{
	"question": "What has the component 3LGM² Application Component?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2ApplicationComponent>. }"
},
{
	"question": "What uses IuKDG?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/IuKDG>. }"
},
{
	"question": "What are components of Standard?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Standard> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "Who is responsible for  First-Level Support?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/FirstLevelSupport>. }"
},
{
	"question": "What are components of 3LGMÂ²-S?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/3LGM2S> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What updates Nursing Anamnesis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/NursingAnamnesis>. }"
},
{
	"question": "What has the component Preparation of an Order?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PreparationOfAnOrder>. }"
},
{
	"question": "What uses EFQM Excellence Model?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/EfqmExcellenceModel>. }"
},
{
	"question": "What has the component Strategic HIS Monitoring?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/StrategicHISMonitoring>. }"
},
{
	"question": "What has the component Material and Medication Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/MaterialAndMedicationManagement>. }"
},
{
	"question": "What has the component HL7 CDA?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HL7CDA>. }"
},
{
	"question": "What uses Quality?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Quality>. }"
},
{
	"question": "What has the component Database System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DatabaseSystem>. }"
},
{
	"question": "What has the component Execution of Diagnostic and Therapeutic Procedures?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ExecutionOfDiagnosticAndTherapeuticProcedures>. }"
},
{
	"question": "What updates Server?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Server>. }"
},
{
	"question": "What has the component Material Controlling?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/MaterialControlling>. }"
},
{
	"question": "What has the component 3LGM² Tool Class?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2ToolClass>. }"
},
{
	"question": "What has the component HL7 Message Type?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HL7MessageType>. }"
},
{
	"question": "What is updated by Enterprise Function?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EnterpriseFunction> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is updated by Approval to Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ApprovalToStrategicInformationManagementPlan> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What updates Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/StrategicInformationManagementPlan>. }"
},
{
	"question": "What uses hospital information system model?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HospitalInformationSystemModel>. }"
},
{
	"question": "What uses KHStatV?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/KhStatV>. }"
},
{
	"question": "What is used by Research Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ResearchManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Hospital Revenue?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HospitalRevenue>. }"
},
{
	"question": "What has the component Long Term Archiving?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/LongTermArchiving>. }"
},
{
	"question": "What is Information Desk responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/InformationDesk> <http://www.snik.eu/ontology/meta/isResponsibleForFunction> ?o. }"
},
{
	"question": "What has the component Planning of Organizational Structures?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PlanningOfOrganizationalStructures>. }"
},
{
	"question": "What has the component Computer Network?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ComputerNetwork>. }"
},
{
	"question": "What has the component Medication?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Medication>. }"
},
{
	"question": "What has the component Study Objective?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/StudyObjective>. }"
},
{
	"question": "What is used by Operationalization of Methods and Detailed Study Plan?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OperationalizationOfMethodsAndDetailedStudyPlan> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Continual Service Improvement?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ContinualServiceImprovement>. }"
},
{
	"question": "What has the component Social History?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/SocialHistory>. }"
},
{
	"question": "What uses Project Management Method?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ProjectManagementMethod>. }"
},
{
	"question": "What is updated by Patient Admission?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientAdmission> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of First-Level Support?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FirstLevelSupport> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is updated by Research Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ResearchManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What updates Knowledge about Medical Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/MedicalProcedure>. }"
},
{
	"question": "What is used by Hospital Function?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HospitalFunction> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is used by Material and Medication Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MaterialAndMedicationManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is updated by Strategic HIS Directing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicHISDirecting> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Trouble Shooting?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/TroubleShootingInItServiceManagement>. }"
},
{
	"question": "What has the component 3LGM²-S Service?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2SService>. }"
},
{
	"question": "What uses Patient Transport?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/PatientTransport>. }"
},
{
	"question": "What updates Bill?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Bill>. }"
},
{
	"question": "What has the component Tactical Information Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/TacticalInformationManagement>. }"
},
{
	"question": "What are components of ISO 9241?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ISO9241> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of 3LGMÂ² Physical Tool Layer?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/3LGM2PhysicalToolLayer> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of Top Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TopManagement> <http://www.snik.eu/ontology/meta/roleComponent> ?o. }"
},
{
	"question": "What updates Operation Report?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/OperationReport>. }"
},
{
	"question": "What has the component Hospital?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/Hospital>. }"
},
{
	"question": "What is IT Service Management Staff responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ItServiceManagementStaff> <http://www.snik.eu/ontology/meta/isResponsibleForFunction> ?o. }"
},
{
	"question": "What has the component Storage Medium?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/StorageMedium>. }"
},
{
	"question": "What is used by Information Management in Health Care Networks?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/InformationManagementInHealthCareNetworks> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is Integrated Care Network responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/IntegratedCareNetwork> <http://www.snik.eu/ontology/meta/isResponsibleForFunction> ?o. }"
},
{
	"question": "What is used by Knowledge Retrieval and Literature Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/KnowledgeRetrievalAndLiteratureManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What are components of Operation Report?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OperationReport> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Project Planning Phase?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ProjectPlanningPhase>. }"
},
{
	"question": "What has the component Diagnosis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Diagnosis>. }"
},
{
	"question": "What has the component 3LGM² Physical Data Processing System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2PhysicalDataProcessingSystem>. }"
},
{
	"question": "What has the component Execution of Diagnostic Therapeutic and Nursing Procedures?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ExecutionOfDiagnosticTherapeuticAndNursingProcedures>. }"
},
{
	"question": "What uses Information System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/InformationSystem>. }"
},
{
	"question": "What is decreased by ensure process integration?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EnsureProcessIntegration> <http://www.snik.eu/ontology/meta/decreases> ?o. }"
},
{
	"question": "What is used by Clinical Research?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ClinicalResearch> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is used by Operational Information Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OperationalInformationManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What updates DRG?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Drg>. }"
},
{
	"question": "What updates Nursing Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/NursingProcedure>. }"
},
{
	"question": "Who is responsible for  Information Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/InformationManagement>. }"
},
{
	"question": "What has the component Transfer Diagnosis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/TransferDiagnosis>. }"
},
{
	"question": "What uses Clinical Trial?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ClinicalTrial>. }"
},
{
	"question": "What is updated by Long-Term HIS Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/LongTermHISPlanning> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of ACID?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Acid> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of Hospital Strategy?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HospitalStrategy> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component 3LGM²-M Message Type?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2MMessageType>. }"
},
{
	"question": "What uses Information Management Cost?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/InformationManagementCost>. }"
},
{
	"question": "What is used by Risk Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/RiskManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What uses Standard?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Standard>. }"
},
{
	"question": "What uses Laundry?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Laundry>. }"
},
{
	"question": "What is used by Report and Publication of Study?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ReportAndPublicationOfStudy> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What uses Human Resource?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HumanResource>. }"
},
{
	"question": "Who is responsible for  Certification by EuroRec?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/CertificationByEuroRec>. }"
},
{
	"question": "What has the component OpenEHR Model of Processes?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/OpenEHRModelOfProcesses>. }"
},
{
	"question": "What has the component External Finding?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ExternalFinding>. }"
},
{
	"question": "What uses Physical Data Processing System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/PhysicalDataProcessingSystem>. }"
},
{
	"question": "Who is responsible for  Nursing Admission?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/NursingAdmission>. }"
},
{
	"question": "What uses Study Result?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/StudyResult>. }"
},
{
	"question": "What has the component Federated Database Schema?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/FederatedDatabaseSchema>. }"
},
{
	"question": "What is Standardization of Interfaces based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StandardizationOfInterfaces> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What increases Quality of Data?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/increases> <http://www.snik.eu/ontology/bb/QualityOfData>. }"
},
{
	"question": "What uses Project Execution Module?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ProjectExecutionModule>. }"
},
{
	"question": "What uses Medication?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Medication>. }"
},
{
	"question": "What are components of HL7 Version 3?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HL7Version3> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
}]