[{
	"question": "What has the component 3LGM² Interlayer Relationship?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2InterlayerRelationship>. }"
},
{
	"question": "What is increased by ensure data integration?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EnsureDataIntegration> <http://www.snik.eu/ontology/meta/increases> ?o. }"
},
{
	"question": "What is updated by HIS Benchmarking?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HisBenchmarking> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of Service Operation?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ServiceOperation> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "Who is responsible for  Project Monitoring?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/ProjectMonitoring>. }"
},
{
	"question": "What are components of Tactical HIS Directing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TacticalHISDirecting> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What uses Informed Consent?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/InformedConsent>. }"
},
{
	"question": "What updates Patient Record Archive?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/PatientRecordArchive>. }"
},
{
	"question": "What uses IT Service?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ItService>. }"
},
{
	"question": "What is updated by Management of Medical Devices?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ManagementOfMedicalDevices> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is Project Management Board responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ProjectManagementBoard> <http://www.snik.eu/ontology/meta/isResponsibleForFunction> ?o. }"
},
{
	"question": "What is updated by Patient Identification and Checking for Recurrent?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientIdentificationAndCheckingForRecurrent> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is updated by ITIL Service Lifecycle?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ItilServiceLifecycle> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Maintenance Cost?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/MaintenanceCost>. }"
},
{
	"question": "What is based on Business Process Metamodel?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/BusinessProcessMetamodel>. }"
},
{
	"question": "What are components of Technical Metamodel?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TechnicalMetamodel> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Administrative Admission?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/AdministrativeAdmission>. }"
},
{
	"question": "What has the component Information Processing Model?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/InformationProcessingModel>. }"
},
{
	"question": "What has the component 3LGM² Communication Interface?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2CommunicationInterface>. }"
},
{
	"question": "Who is responsible for  Certification by CCHIT?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/CertificationByCCHIT>. }"
},
{
	"question": "What is updated by Facility Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FacilityManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of Nursing Report?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/NursingReport> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What updates Laundry?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Laundry>. }"
},
{
	"question": "What are components of Computer-Supported Information System?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ComputerSupportedInformationSystem> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is used by Administrative Discharge and Billing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdministrativeDischargeAndBilling> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Long-Term HIS Planning?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/LongTermHISPlanning>. }"
},
{
	"question": "What uses Operational Management Concept?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/OperationalManagementConcept>. }"
},
{
	"question": "What has the component Scheduling and Resource Planning with the Patient Transport Service?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/SchedulingAndResourcePlanningWithThePatientTransportService>. }"
},
{
	"question": "What has the component Improving Customer-Centered Services?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ImprovingCustomerCenteredServices>. }"
},
{
	"question": "What has the component Governmental Authority?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/GovernmentalAuthority>. }"
},
{
	"question": "What are components of Computer-Based Nursing Form?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ComputerBasedNursingForm> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of Human Resource Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HumanResourceManagement> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is updated by Analysis and Assessment of the Current HIS State?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AnalysisAndAssessmentOfTheCurrentHISState> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What increases Transparency?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/increases> <http://www.snik.eu/ontology/bb/Transparency>. }"
},
{
	"question": "What uses Reference Model?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ReferenceModel>. }"
},
{
	"question": "What has the component Project Resource Allocation?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ProjectResourceAllocation>. }"
},
{
	"question": "What is updated by Coding of Diagnoses?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/CodingOfDiagnoses> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is updated by Permanent Monitoring?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PermanentMonitoring> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Operational HIS Monitoring?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/OperationalHISMonitoring>. }"
},
{
	"question": "What updates Preliminary Outline of a Study?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/PreliminaryOutlineOfAStudy>. }"
},
{
	"question": "What has the component Application Server?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ApplicationServer>. }"
},
{
	"question": "What has the component Order Form?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/OrderForm>. }"
},
{
	"question": "What is Health Insurance Company responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HealthInsuranceCompany> <http://www.snik.eu/ontology/meta/isResponsibleForFunction> ?o. }"
},
{
	"question": "What has the component Order Entry?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/OrderEntry>. }"
},
{
	"question": "What has the component Entity Type Modeling Element?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/EntityTypeModelingElement>. }"
},
{
	"question": "What are components of Controlling?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Controlling> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What are components of Supply and Disposal Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/SupplyAndDisposalManagement> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What uses Electronic Health Record?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ElectronicHealthRecord>. }"
},
{
	"question": "What uses Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/StrategicInformationManagementPlan>. }"
},
{
	"question": "What has the component HL7 Version 3 Message?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HL7Version3Message>. }"
},
{
	"question": "What uses Vital Sign?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/VitalSign>. }"
},
{
	"question": "What has the component 3LGM²-S Invoking Interface?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2SInvokingInterface>. }"
},
{
	"question": "What uses Health Care Regulation?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HealthCareRegulation>. }"
},
{
	"question": "What has the component Diet?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Diet>. }"
},
{
	"question": "Who is involved in Decision Making and Patient Information?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isInvolvedIn> <http://www.snik.eu/ontology/bb/DecisionMakingAndPatientInformation>. }"
},
{
	"question": "What updates Resource?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Resource>. }"
},
{
	"question": "What is used by Tactical HIS Monitoring?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TacticalHISMonitoring> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What updates Study Hypothesis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/StudyHypothesis>. }"
},
{
	"question": "Who is responsible for  Knowledge about Medical Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/MedicalProcedure>. }"
},
{
	"question": "What are components of 3LGMÂ² Logical Tool Layer?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/3LGM2LogicalToolLayer> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Rehabilitation Center?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/RehabilitationCenter>. }"
},
{
	"question": "What has the component Customizing?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/Customizing>. }"
},
{
	"question": "What uses HIS Quality?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HisQuality>. }"
},
{
	"question": "What has the component Project?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Project>. }"
},
{
	"question": "What is updated by Execution of Diagnostic and Therapeutic Procedures?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ExecutionOfDiagnosticAndTherapeuticProcedures> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is updated by Operational Information Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OperationalInformationManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is updated by Preparation of an Order?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PreparationOfAnOrder> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What uses Order Catalog?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/OrderCatalog>. }"
},
{
	"question": "What are components of System Specification?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/SystemSpecification> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What has the component Network Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/NetworkManagement>. }"
},
{
	"question": "What updates Physical Data Processing System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/PhysicalDataProcessingSystem>. }"
},
{
	"question": "What is used by Internal Quality Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/InternalQualityManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is updated by Ad Hoc Monitoring?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdHocMonitoring> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is updated by Medical Discharge and Medical Report Writing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MedicalDischargeAndMedicalReportWriting> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of 3-tier Architecture?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/3TierArchitecture> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Designing Customer-Centered Services?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/DesigningCustomerCenteredServices>. }"
},
{
	"question": "What updates Clinical Trial?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ClinicalTrial>. }"
},
{
	"question": "What is used by DRG Calculation?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DrgCalculation> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What updates Medical Guideline?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/MedicalGuideline>. }"
},
{
	"question": "What is used by Publishing and Presentation?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PublishingAndPresentation> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is updated by Medical Admission?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MedicalAdmission> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Strategic Goal of the Institution?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/StrategicGoalOfTheInstitution>. }"
},
{
	"question": "What has the component Medical Anamnesis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/MedicalAnamnesis>. }"
},
{
	"question": "What is Reference Model based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ReferenceModel> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What has the component Quality of Computer-Based Application Components and Their Integration?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/QualityOfComputerBasedApplicationComponentsAndTheirIntegration>. }"
},
{
	"question": "What has the component Hospital Cost?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HospitalCost>. }"
},
{
	"question": "What is updated by Project Execution?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ProjectExecution> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What uses Bill?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Bill>. }"
},
{
	"question": "What has the component Treatment Text?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/TreatmentText>. }"
},
{
	"question": "What has the component Paper-Based Patient Record?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/PaperBasedPatientRecord>. }"
},
{
	"question": "What has the component Planning?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/Planning>. }"
},
{
	"question": "What has the component DICOM File Format?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DicomFileFormat>. }"
},
{
	"question": "What has the component Execution of an IT Evaluation Study?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ExecutionOfAnITEvaluationStudy>. }"
},
{
	"question": "What is updated by Strategic Alignment?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicAlignment> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of 3LGMÂ² Domain Layer?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/3LGM2DomainLayer> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component 3LGM² Organizational Unit?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2OrganizationalUnit>. }"
},
{
	"question": "What has the component ISO 9241-110 User Interface Design Quality?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ISO9241110UserInterfaceDesignQuality>. }"
},
{
	"question": "Who is responsible for  Business Strategy?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/BusinessStrategy>. }"
},
{
	"question": "What updates Hospital Business Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/HospitalBusinessPlan>. }"
},
{
	"question": "What has the component Directing?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/Directing>. }"
},
{
	"question": "What is Data Security Officer responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DataSecurityOfficer> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "What are components of Archiving of Patient Information?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ArchivingOfPatientInformation> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What are components of Organizational Model?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OrganizationalModel> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is Vendor responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Vendor> <http://www.snik.eu/ontology/meta/isResponsibleForFunction> ?o. }"
},
{
	"question": "What are components of Integrated Care Network?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/IntegratedCareNetwork> <http://www.snik.eu/ontology/meta/roleComponent> ?o. }"
},
{
	"question": "What has the component Nursing Goal?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/NursingGoal>. }"
},
{
	"question": "What updates Project Portfolio?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ProjectPortfolio>. }"
},
{
	"question": "What has the component 3LGM²-M Communication Standard?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2MCommunicationStandard>. }"
},
{
	"question": "What is updated by Order Entry?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OrderEntry> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of HIS Quality?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HisQuality> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What updates Administrative Patient Data?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/AdministrativePatientData>. }"
},
{
	"question": "What has the component Use of Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/UseOfStrategicInformationManagementPlan>. }"
},
{
	"question": "What updates Referential Integrity?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ReferentialIntegrity>. }"
},
{
	"question": "What has the component UML Attribute?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/UmlAttribute>. }"
},
{
	"question": "What uses Medical and Nursing Knowledge?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/MedicalAndNursingKnowledge>. }"
},
{
	"question": "Who is responsible for  Delivering of Customer-Centered Services?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/DeliveringOfCustomerCenteredServices>. }"
},
{
	"question": "What has the component Appointment Scheduling?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/AppointmentScheduling>. }"
},
{
	"question": "What is updated by Catering?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Catering> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of Scheduling and Resource Allocation?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/SchedulingAndResourceAllocation> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What has the component HIS Component?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HisComponent>. }"
},
{
	"question": "What is Hardware Vendor involved in?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HardwareVendor> <http://www.snik.eu/ontology/meta/isInvolvedIn> ?o. }"
},
{
	"question": "What is used by Administration of Human Resource Master Data?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdministrationOfHumanResourceMasterData> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What updates IT Service?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ItService>. }"
},
{
	"question": "Who is responsible for  Hospital Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/HospitalManagement>. }"
},
{
	"question": "What is updated by Medical and Nursing Care Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MedicalAndNursingCarePlanning> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component User Training?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/UserTraining>. }"
},
{
	"question": "What uses KHRG?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Khrg>. }"
},
{
	"question": "What uses Architecture of an Information System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ArchitectureOfAnInformationSystem>. }"
},
{
	"question": "What has the component Non-Computer-Based Information Processing Tool?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/NonComputerBasedInformationProcessingTool>. }"
},
{
	"question": "What has the component Report and Publication of Study?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ReportAndPublicationOfStudy>. }"
},
{
	"question": "What uses Therapeutic Standard?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/TherapeuticStandard>. }"
},
{
	"question": "What uses SGB V?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Sgbv>. }"
},
{
	"question": "What uses 3LGM² Entity Type?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/3LGM2EntityType>. }"
},
{
	"question": "What is based on Object Identity?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/ObjectIdentity>. }"
},
{
	"question": "What is based on 3LGM²?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/3LGM2>. }"
},
{
	"question": "What are components of Execution of Clinical Trials?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ExecutionOfClinicalTrials> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is Business Process Reference Model based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/BusinessProcessReferenceModel> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What is updated by Designing Customer-Centered Services?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DesigningCustomerCenteredServices> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of Hospital Administration?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HospitalAdministration> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What uses Facility and Area?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/FacilityAndArea>. }"
},
{
	"question": "What is EuroRec responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EuroRec> <http://www.snik.eu/ontology/meta/isResponsibleForFunction> ?o. }"
},
{
	"question": "What updates Facility and Area?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/FacilityAndArea>. }"
}]