[{
	"question": "What updates Written Agreement on the Study Outline?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/WrittenAgreementOnTheStudyOutline>. }"
},
{
	"question": "What uses Knowledge about Therapeutic Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/TherapeuticProcedure>. }"
},
{
	"question": "What is used by Fulfillment of the Expectations of Different Stakeholders?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FulfillmentOfTheExpectationsOfDifferentStakeholders> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What are components of Information Management Operating Cost?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/InformationManagementOperatingCost> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is updated by Certification by CCHIT?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/CertificationByCCHIT> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Ad Hoc Monitoring?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/AdHocMonitoring>. }"
},
{
	"question": "What decreases Media Crack?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/decreases> <http://www.snik.eu/ontology/bb/MediaCrack>. }"
},
{
	"question": "What is International DICOM Committee responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/InternationalDICOMCommittee> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "What uses Description of the Current HIS State?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/DescriptionOfTheCurrentHISState>. }"
},
{
	"question": "What has the component ITIL Service Lifecycle?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ItilServiceLifecycle>. }"
},
{
	"question": "What is used by Catering?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Catering> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What uses Diagnosis Class?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/DiagnosisClass>. }"
},
{
	"question": "What uses Project?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Project>. }"
},
{
	"question": "What are components of IHE Integration Profile?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/IheIntegrationProfile> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Quality of Outcome?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/QualityOfOutcome>. }"
},
{
	"question": "What has the component IHE Content Profile?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/IheContentProfile>. }"
},
{
	"question": "What is based on Evaluation Method?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/EvaluationMethod>. }"
},
{
	"question": "What has the component Research Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ResearchManagement>. }"
},
{
	"question": "What is used by Monitoring of Vital Signs?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MonitoringOfVitalSigns> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component 3LGM² Logical Tool Layer?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2LogicalToolLayer>. }"
},
{
	"question": "What has the component Operationalization of Methods and Detailed Study Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/OperationalizationOfMethodsAndDetailedStudyPlan>. }"
},
{
	"question": "What is updated by Establishing Referential Integrity?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EstablishingReferentialIntegrity> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is used by Quality Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/QualityManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is 3LGMÂ² Tool based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/3LGM2Tool> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What are components of Information Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/InformationManagement> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What has the component Nursing Center?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/NursingCenter>. }"
},
{
	"question": "What are components of Tactical HIS Monitoring?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TacticalHISMonitoring> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is Model based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Model> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What uses Study Outline?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/StudyOutline>. }"
},
{
	"question": "What has the component Execution of Nursing Procedures?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ExecutionOfNursingProcedures>. }"
},
{
	"question": "What is updated by Strategic HIS Monitoring?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicHISMonitoring> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is used by Work Organization and Time Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/WorkOrganizationAndTimeManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What uses BDSG?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Bdsg>. }"
},
{
	"question": "What are components of Business Strategy?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/BusinessStrategy> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is updated by 3LGMÂ² Enterprise Function?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/3LGM2EnterpriseFunction> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Monitoring the Project Progress?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/MonitoringTheProjectProgress>. }"
},
{
	"question": "What updates Storage Medium?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/StorageMedium>. }"
},
{
	"question": "What has the component Business Process Model?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/BusinessProcessModel>. }"
},
{
	"question": "What updates Controlling Report?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ControllingReport>. }"
},
{
	"question": "What are components of Project Management Board?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ProjectManagementBoard> <http://www.snik.eu/ontology/meta/roleComponent> ?o. }"
},
{
	"question": "What are components of Service Transition?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ServiceTransition> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is used by Execution of a Quantitative Study?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ExecutionOfAQuantitativeStudy> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Recruitment of Patients?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/RecruitmentOfPatients>. }"
},
{
	"question": "What is updated by Certification by ISO?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/CertificationByISO> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What uses HIS Certificate?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HisCertificate>. }"
},
{
	"question": "What are components of Infrastructure of an Information System?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/InfrastructureOfAnInformationSystem> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Financial Controlling?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/FinancialControlling>. }"
},
{
	"question": "What are components of Data Model?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DataModel> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What updates Network?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Network>. }"
},
{
	"question": "What uses Diagnosis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Diagnosis>. }"
},
{
	"question": "What is updated by management of electronic health records?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ManagementOfEhr> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "Who is responsible for  Approval to Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/ApprovalToStrategicInformationManagementPlan>. }"
},
{
	"question": "What has the component IHE Integration Profile?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/IheIntegrationProfile>. }"
},
{
	"question": "What is used by Patient Identification and Checking for Recurrent?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientIdentificationAndCheckingForRecurrent> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is updated by DRG Calculation?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DrgCalculation> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is used by Controlling?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Controlling> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Scheduling and Resource Planning with the Medical Service Unit?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/SchedulingAndResourcePlanningWithTheMedicalServiceUnit>. }"
},
{
	"question": "What uses Clinical Pathway?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ClinicalPathway>. }"
},
{
	"question": "What has the component Problem Solving?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ProblemSolving>. }"
},
{
	"question": "What uses Evaluation Method?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/EvaluationMethod>. }"
},
{
	"question": "What are components of Execution of Diagnostic Therapeutic and Nursing Procedures?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ExecutionOfDiagnosticTherapeuticAndNursingProcedures> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What uses Appointment?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Appointment>. }"
},
{
	"question": "What uses Food?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Food>. }"
},
{
	"question": "What has the component Coding of Diagnoses?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/CodingOfDiagnoses>. }"
},
{
	"question": "What is Clinical Department involved in?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ClinicalDepartment> <http://www.snik.eu/ontology/meta/isInvolvedIn> ?o. }"
},
{
	"question": "What uses Backbone?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Backbone>. }"
},
{
	"question": "What updates Application Portfolio?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ApplicationPortfolio>. }"
},
{
	"question": "What updates Strategic Information Management Goal?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/StrategicInformationManagementGoal>. }"
},
{
	"question": "What are components of Strategic HIS Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicHISPlanning> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What updates Inpatient EHR Certification?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/InpatientEHRCertification>. }"
},
{
	"question": "What updates Cost of Treatment?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/CostOfTreatment>. }"
},
{
	"question": "What are components of Patient Care?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientCare> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What has the component HL7 Message Header?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HL7MessageHeader>. }"
},
{
	"question": "What updates Description of the Current HIS State?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/DescriptionOfTheCurrentHISState>. }"
},
{
	"question": "What has the component Diagnosis Class?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DiagnosisClass>. }"
},
{
	"question": "What is used by First Study Design?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FirstStudyDesign> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is used by Strategic Information Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicInformationManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Support Cost?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/SupportCost>. }"
},
{
	"question": "What updates Information System Model?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/InformationSystemModel>. }"
},
{
	"question": "What has the component Strategic Information Management Goal?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/StrategicInformationManagementGoal>. }"
},
{
	"question": "What has the component Planning of Rooms?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PlanningOfRooms>. }"
},
{
	"question": "What is EN1613 based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EN1613> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "Who is responsible for  Joint Commission’s Certification Program?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/JointCommissionsCertificationProgram>. }"
},
{
	"question": "What has the component Planning of Staff?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PlanningOfStaff>. }"
},
{
	"question": "What has the component Strategic Hospital Goal?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/StrategicHospitalGoal>. }"
},
{
	"question": "What uses Strategic Alignment Model?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/StrategicAlignmentModel>. }"
},
{
	"question": "What has the component Portfolio Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PortfolioManagement>. }"
},
{
	"question": "What updates IT Evaluation Study?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ItEvaluationStudy>. }"
},
{
	"question": "What has the component Observation Protocol?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ObservationProtocol>. }"
},
{
	"question": "What uses CCHIT Functional Criterion?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/CchitFunctionalCriterion>. }"
},
{
	"question": "What updates Administrative Guideline?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/AdministrativeGuideline>. }"
},
{
	"question": "What uses HIS Benchmarking Method?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HisBenchmarkingMethod>. }"
},
{
	"question": "What uses Nursing Care Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/NursingCarePlan>. }"
},
{
	"question": "What updates Knowledge about Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Procedure>. }"
},
{
	"question": "What is updated by Human Resource Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HumanResourceManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Quality of HIS Processes?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/QualityOfHISProcesses>. }"
},
{
	"question": "What are components of Event-Driven Process Chain?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EventDrivenProcessChain> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of IHE Domain?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/IheDomain> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Computer-Based Application Component?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ComputerBasedApplicationComponent>. }"
},
{
	"question": "What has the component 3LGM² Transmitting Medium?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2TransmittingMedium>. }"
},
{
	"question": "What has the component Organizational Unit Modeling Element?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/OrganizationalUnitModelingElement>. }"
},
{
	"question": "What updates Observation Protocol?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ObservationProtocol>. }"
},
{
	"question": "What has the component 3LGM² Communication Link?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2CommunicationLink>. }"
},
{
	"question": "What has the component Computer-Based Tool?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ComputerBasedTool>. }"
},
{
	"question": "What is used by Facility Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FacilityManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "Who is involved in Medical and Nursing Care Planning?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isInvolvedIn> <http://www.snik.eu/ontology/bb/MedicalAndNursingCarePlanning>. }"
},
{
	"question": "What has the component Activity Modeling Element?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ActivityModelingElement>. }"
},
{
	"question": "What updates Bed?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Bed>. }"
},
{
	"question": "What are components of Hospital Budget?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HospitalBudget> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Patient State?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/PatientState>. }"
},
{
	"question": "What is used by 3LGMÂ² Enterprise Function?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/3LGM2EnterpriseFunction> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is Joint Commission responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/JointCommission> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "What is based on UML Class Diagram?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/UmlClassDiagram>. }"
},
{
	"question": "What uses Nursing History?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/NursingHistory>. }"
},
{
	"question": "What has the component Description of the Current HIS State?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DescriptionOfTheCurrentHISState>. }"
},
{
	"question": "What has the component Quality of HIS Outcome?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/QualityOfHISOutcome>. }"
},
{
	"question": "What is used by Tactical HIS Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TacticalHISPlanning> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is based on EDIFACT?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/Edifact>. }"
},
{
	"question": "What updates Strategic Hospital Goal?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/StrategicHospitalGoal>. }"
},
{
	"question": "What updates 3LGM² Entity Type?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/3LGM2EntityType>. }"
},
{
	"question": "What is used by Delivering of Customer-Centered Services?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DeliveringOfCustomerCenteredServices> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What are components of OpenEHR?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OpenEHR> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Communication Ability?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/CommunicationAbility>. }"
},
{
	"question": "What is updated by Performance of Legal Notification Requirements?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PerformanceOfLegalNotificationRequirements> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Project Execution Module?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ProjectExecutionModule>. }"
},
{
	"question": "What has the component 3LGM² Location?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2Location>. }"
},
{
	"question": "What is updated by Operationalization of Methods and Detailed Study Plan?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OperationalizationOfMethodsAndDetailedStudyPlan> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is updated by Cost Accounting?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/CostAccounting> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Top Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/TopManagement>. }"
},
{
	"question": "What is updated by Execution of an Operation?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ExecutionOfAnOperation> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What uses Hospital Service?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HospitalService>. }"
},
{
	"question": "What is based on Data Metamodel?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/DataMetamodel>. }"
},
{
	"question": "What is used by Decision Making and Patient Information?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DecisionMakingAndPatientInformation> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What updates Application Component?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ApplicationComponent>. }"
},
{
	"question": "What has the component Payroll Accounting?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PayrollAccounting>. }"
},
{
	"question": "What is used by Fulfillment of Laws relevant to Information Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FulfillmentOfLawsRelevantToInformationManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is Nurse responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Nurse> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "What are components of Patient Record?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientRecord> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is used by Payroll Accounting?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PayrollAccounting> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What are components of Clinical Pathway?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ClinicalPathway> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is HL7 Version 3 based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HL7Version3> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What has the component Staff Cost?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/StaffCost>. }"
},
{
	"question": "What is updated by Execution of Clinical Trials and Experiments?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ExecutionOfClinicalTrialsAndExperiments> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is updated by Short-Term HIS Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ShortTermHISPlanning> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Management> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What are components of Quality?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Quality> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Coding of Diagnoses and Procedures?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/CodingOfDiagnosesAndProcedures>. }"
},
{
	"question": "What is used by Financing of Health Care?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FinancingOfHealthCare> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Service Design?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ServiceDesign>. }"
},
{
	"question": "What is updated by Portfolio Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PortfolioManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
}]