[{
	"question": "What is used by management of electronic health records?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ManagementOfEhr> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is increased by Fulfillment of Laws relevant to Information Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FulfillmentOfLawsRelevantToInformationManagement> <http://www.snik.eu/ontology/meta/increases> ?o. }"
},
{
	"question": "What uses Strategic Goal of the Network?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/StrategicGoalOfTheNetwork>. }"
},
{
	"question": "What uses Third-Party Fund?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ThirdPartyFund>. }"
},
{
	"question": "What has the component 3LGM² Information Process?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2InformationProcess>. }"
},
{
	"question": "Who is responsible for  Computing Center?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/ComputingCenter>. }"
},
{
	"question": "What are components of Strategic HIS Monitoring?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicHISMonitoring> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is used by Strategic HIS Directing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicHISDirecting> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What updates Study Report?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/StudyReport>. }"
},
{
	"question": "What is updated by Appointment Scheduling?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AppointmentScheduling> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Information Management in Hospitals?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/InformationManagementInHospitals>. }"
},
{
	"question": "What has the component Project Completion Phase?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ProjectCompletionPhase>. }"
},
{
	"question": "What has the component OpenEHR Model of Content?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/OpenEHRModelOfContent>. }"
},
{
	"question": "Who is responsible for  Improving Customer-Centered Services?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/ImprovingCustomerCenteredServices>. }"
},
{
	"question": "What has the component Clinical Pathway?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ClinicalPathway>. }"
},
{
	"question": "What updates Hospital Information System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/HospitalInformationSystem>. }"
},
{
	"question": "What are components of Patient Admission?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientAdmission> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What has the component SOA Service?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/SoaService>. }"
},
{
	"question": "What has the component Project Execution?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ProjectExecution>. }"
},
{
	"question": "What has the component Activity?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Activity>. }"
},
{
	"question": "What is updated by Tactical HIS Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TacticalHISPlanning> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Procedure Class?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ProcedureClass>. }"
},
{
	"question": "What has the component Operational HIS Directing?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/OperationalHISDirecting>. }"
},
{
	"question": "What is decreased by ensure data integration?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EnsureDataIntegration> <http://www.snik.eu/ontology/meta/decreases> ?o. }"
},
{
	"question": "What are components of Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StrategicInformationManagementPlan> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is updated by Study Exploration?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StudyExploration> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Role Modeling Element?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/RoleModelingElement>. }"
},
{
	"question": "What increases Consistency?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/increases> <http://www.snik.eu/ontology/bb/Consistency>. }"
},
{
	"question": "What has the component Quality of Processes?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/QualityOfProcesses>. }"
},
{
	"question": "What has the component Incident Analysis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/IncidentAnalysis>. }"
},
{
	"question": "What are components of Annual Hospital Operating Cost?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AnnualHospitalOperatingCost> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Organizational Model?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/OrganizationalModel>. }"
},
{
	"question": "What are components of Clinical Information System?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ClinicalInformationSystem> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is updated by Administration and Allocation of Patient Records?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdministrationAndAllocationOfPatientRecords> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component 3LGM² Intralayer Relationship?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2IntralayerRelationship>. }"
},
{
	"question": "Who is responsible for  Integrated Care?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/IntegratedCare>. }"
},
{
	"question": "What has the component Event Modeling Element?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/EventModelingElement>. }"
},
{
	"question": "What has the component HIS Stakeholder?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/HisStakeholder>. }"
},
{
	"question": "What has the component Health Insurance Company?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/HealthInsuranceCompany>. }"
},
{
	"question": "What is Communication Network based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/CommunicationNetwork> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What has the component Quality of HIS Structures?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/QualityOfHISStructures>. }"
},
{
	"question": "What is used by Patient Billing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientBilling> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "Who is responsible for  Operational Information Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/OperationalInformationManagement>. }"
},
{
	"question": "What uses Procedure Class?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ProcedureClass>. }"
},
{
	"question": "What has the component Consistency?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Consistency>. }"
},
{
	"question": "What are components of HL7 Message Type Event Type Combination?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HL7MessageTypeEventTypeCombination> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is Reference Model for the Domain Layer of Hospital Information Systems based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ReferenceModelForTheDomainLayerOfHospitalInformationSystems> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What has the component HL7 Patient Visit Information?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HL7PatientVisitInformation>. }"
},
{
	"question": "What is used by Long Term Archiving?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/LongTermArchiving> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What uses Research Document?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ResearchDocument>. }"
},
{
	"question": "What is used by Hospital Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HospitalManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component HIS Certification?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/HisCertification>. }"
},
{
	"question": "What is updated by Publishing and Presentation?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PublishingAndPresentation> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is used by Modeling Information Systems?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ModelingInformationSystems> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Data Model?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DataModel>. }"
},
{
	"question": "What has the component IHE Transaction?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/IheTransaction>. }"
},
{
	"question": "What updates Study Design?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/StudyDesign>. }"
},
{
	"question": "What has the component Vital Sign?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/VitalSign>. }"
},
{
	"question": "What has the component ISO 9241-110?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ISO9241110>. }"
},
{
	"question": "What are components of ADT?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Adt> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "Who is responsible for  Designing Customer-Centered Services?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/DesigningCustomerCenteredServices>. }"
},
{
	"question": "Who is responsible for  Performance of Application Components?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/PerformanceOfApplicationComponents>. }"
},
{
	"question": "What are components of Diagnosis Class?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DiagnosisClass> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "Who is responsible for  Annual IT Budget?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/AnnualITBudget>. }"
},
{
	"question": "What has the component T3 Database Server?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/T3DatabaseServer>. }"
},
{
	"question": "What is updated by Administrative Admission?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdministrativeAdmission> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is based on Metamodel?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/Metamodel>. }"
},
{
	"question": "What is used by Enterprise Function?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EnterpriseFunction> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What uses Transfer?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Transfer>. }"
},
{
	"question": "What is Service Desk Staff responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ServiceDeskStaff> <http://www.snik.eu/ontology/meta/isResponsibleForFunction> ?o. }"
},
{
	"question": "What updates Electronic Health Record?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ElectronicHealthRecord>. }"
},
{
	"question": "What uses Best-Practice-Benchmark?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/BestPracticeBenchmark>. }"
},
{
	"question": "What is used by Execution of an IT Evaluation Study?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ExecutionOfAnITEvaluationStudy> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What updates Patient?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Patient>. }"
},
{
	"question": "What updates Transfer?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Transfer>. }"
},
{
	"question": "What uses Medical Anamnesis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/MedicalAnamnesis>. }"
},
{
	"question": "What updates EN12539?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/EN12539>. }"
},
{
	"question": "Who is responsible for  Disease Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/DiseaseManagement>. }"
},
{
	"question": "What are components of Tactical HIS Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TacticalHISPlanning> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What has the component Strategic Alignment?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/StrategicAlignment>. }"
},
{
	"question": "What updates Project Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ProjectPlan>. }"
},
{
	"question": "What are components of Federated Database System?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FederatedDatabaseSystem> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component IHE Actor?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/IheActor>. }"
},
{
	"question": "What updates Finding?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Finding>. }"
},
{
	"question": "What updates HIS Architecture?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/HisArchitecture>. }"
},
{
	"question": "What has the component Administration of Human Resource Master Data?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/AdministrationOfHumanResourceMasterData>. }"
},
{
	"question": "What updates Patient Transport?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/PatientTransport>. }"
},
{
	"question": "What are components of Hospital Business Plan?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HospitalBusinessPlan> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is updated by Patient Billing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientBilling> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is Health Care Professional responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HealthCareProfessional> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "What are components of Life Cycle Management of Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/LifeCycleManagementOfStrategicInformationManagementPlan> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is updated by Tactical Information Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TacticalInformationManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is used by IT Evaluation Study Management and Execution?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ItEvaluationStudyManagementAndExecution> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What updates Nursing Guideline?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/NursingGuideline>. }"
},
{
	"question": "What is updated by Work Organization and Time Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/WorkOrganizationAndTimeManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is used by Continuous HIS Auditing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ContinuousHISAuditing> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What uses Material?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Material>. }"
},
{
	"question": "What is used by Fulfillment of Strategic Hospital Goal?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FulfillmentOfStrategicHospitalGoal> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What are components of Operational HIS Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OperationalHISPlanning> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is HL7 Version 3 Message based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HL7Version3Message> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What are components of Patient Discharge and Transfer to Other Institutions?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientDischargeAndTransferToOtherInstitutions> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What are components of Patient History?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientHistory> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Administrative Discharge and Billing?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/AdministrativeDischargeAndBilling>. }"
},
{
	"question": "What are components of Administrative Patient Data?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdministrativePatientData> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What uses Network?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Network>. }"
},
{
	"question": "What increases Leanness of Information Processing Tools?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/increases> <http://www.snik.eu/ontology/bb/LeannessOfInformationProcessingTools>. }"
},
{
	"question": "What updates Medical Device?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/MedicalDevice>. }"
},
{
	"question": "What is updated by Execution of a Quantitative Study?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ExecutionOfAQuantitativeStudy> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Outpatient Management System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/OutpatientManagementSystem>. }"
},
{
	"question": "What updates hospital information system model?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/HospitalInformationSystemModel>. }"
},
{
	"question": "What uses Patient Record Archive?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/PatientRecordArchive>. }"
},
{
	"question": "What has the component Service Desk Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ServiceDeskManagement>. }"
},
{
	"question": "What has the component Short-Term HIS Planning?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ShortTermHISPlanning>. }"
},
{
	"question": "What has the component Inductive Approach?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/InductiveApproach>. }"
},
{
	"question": "What has the component Project Time Allocation?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ProjectTimeAllocation>. }"
},
{
	"question": "What is updated by Quality Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/QualityManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is based on Data Integration?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/DataIntegration>. }"
},
{
	"question": "What updates EN12538?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/EN12538>. }"
},
{
	"question": "What are components of HIS Architecture?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HisArchitecture> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What uses Knowledge about Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Procedure>. }"
},
{
	"question": "What updates EN1613?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/EN1613>. }"
},
{
	"question": "What updates Admission Diagnosis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/AdmissionDiagnosis>. }"
},
{
	"question": "What are components of Process Chain?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ProcessChain> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What updates Computer-Based Nursing Form?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ComputerBasedNursingForm>. }"
},
{
	"question": "What is used by Tactical HIS Directing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TacticalHISDirecting> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is used by Tactical Information Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TacticalInformationManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Logical Operator Modeling Element?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/LogicalOperatorModelingElement>. }"
},
{
	"question": "Who is involved in Decision Making Planning and Organization of Patient Treatment?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isInvolvedIn> <http://www.snik.eu/ontology/bb/DecisionMakingPlanningAndOrganizationOfPatientTreatment>. }"
},
{
	"question": "What has the component Performance of Legal Notification Requirements?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PerformanceOfLegalNotificationRequirements>. }"
},
{
	"question": "What has the component Education?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/Education>. }"
},
{
	"question": "Who is responsible for  Software Development?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/SoftwareDevelopment>. }"
},
{
	"question": "What has the component Medical and Nursing Care Planning?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/MedicalAndNursingCarePlanning>. }"
},
{
	"question": "Who is responsible for  Data Security?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/DataSecurity>. }"
},
{
	"question": "What is used by HIS Benchmarking?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HisBenchmarking> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Project Initiation Phase?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ProjectInitiationPhase>. }"
},
{
	"question": "What has the component Social Contact?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/SocialContact>. }"
},
{
	"question": "What is based on Technical Metamodel?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/TechnicalMetamodel>. }"
},
{
	"question": "What is updated by HIS Budget Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HisBudgetPlanning> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is updated by Opening a Patient Record?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OpeningAPatientRecord> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Strategic HIS Planning?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/StrategicHISPlanning>. }"
},
{
	"question": "What has the component Nursing Admission?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/NursingAdmission>. }"
},
{
	"question": "What is updated by Internal Quality Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/InternalQualityManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Quality of Data?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/QualityOfData>. }"
},
{
	"question": "What is Computing Center Manager responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ComputingCenterManager> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "What has the component Planning of Organizational Procedures?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PlanningOfOrganizationalProcedures>. }"
},
{
	"question": "What has the component Change Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ChangeManagement>. }"
},
{
	"question": "What uses BPflV?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/BPflV>. }"
},
{
	"question": "What are components of Nursing Care Plan?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/NursingCarePlan> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is used by Archiving of Patient Information?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ArchivingOfPatientInformation> <http://www.snik.eu/ontology/meta/uses> ?o. }"
}]