[{
	"question": "What has the component Evaluation Method?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/EvaluationMethod>. }"
},
{
	"question": "What is updated by Administration of Human Resource Master Data?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdministrationOfHumanResourceMasterData> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is Chief Executive Officer responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ChiefExecutiveOfficer> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "What has the component Family History?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/FamilyHistory>. }"
},
{
	"question": "What are components of Long-Term HIS Planning?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/LongTermHISPlanning> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is updated by Laundry Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/LaundryManagement> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What updates Workstation?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Workstation>. }"
},
{
	"question": "What has the component Business Process?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/BusinessProcess>. }"
},
{
	"question": "What has the component Nursing Anamnesis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/NursingAnamnesis>. }"
},
{
	"question": "Who is involved in Long-Term HIS Planning?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isInvolvedIn> <http://www.snik.eu/ontology/bb/LongTermHISPlanning>. }"
},
{
	"question": "What has the component Information Processing Tool?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/InformationProcessingTool>. }"
},
{
	"question": "What has the component Operational Information Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/OperationalInformationManagement>. }"
},
{
	"question": "What has the component Adoption of Project Result?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/AdoptionOfProjectResult>. }"
},
{
	"question": "What has the component Opening a Patient Record?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/OpeningAPatientRecord>. }"
},
{
	"question": "What is Software Vendor involved in?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/SoftwareVendor> <http://www.snik.eu/ontology/meta/isInvolvedIn> ?o. }"
},
{
	"question": "What has the component Quality of Structures?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/QualityOfStructures>. }"
},
{
	"question": "What is used by Coding of Procedures?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/CodingOfProcedures> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What uses Study Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/StudyPlan>. }"
},
{
	"question": "What has the component Integration Platform?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/IntegrationPlatform>. }"
},
{
	"question": "What has the component Atomicity?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Atomicity>. }"
},
{
	"question": "What is used by Administration of Business Trips and Further Training?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdministrationOfBusinessTripsAndFurtherTraining> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is used by Coding of Diagnoses?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/CodingOfDiagnoses> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What uses Nursing Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/NursingProcedure>. }"
},
{
	"question": "What uses Cost Unit?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/CostUnit>. }"
},
{
	"question": "What updates Informed Consent?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/InformedConsent>. }"
},
{
	"question": "Who is responsible for  HL7 Standard?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/HL7Standard>. }"
},
{
	"question": "What are components of HIS Infrastructure?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HisInfrastructure> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Creation of Strategic Information Management Plan?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/CreationOfStrategicInformationManagementPlan>. }"
},
{
	"question": "What is used by Financial Accounting?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FinancialAccounting> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Asset Accounting?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/AssetAccounting>. }"
},
{
	"question": "What is updated by IT Evaluation Study Management and Execution?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ItEvaluationStudyManagementAndExecution> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of DICOM Standard?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DicomStandard> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Service Transition?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ServiceTransition>. }"
},
{
	"question": "Who is responsible for  Quality?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/Quality>. }"
},
{
	"question": "What has the component Nursing Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/NursingProcedure>. }"
},
{
	"question": "What has the component IT Support?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ItSupport>. }"
},
{
	"question": "What is used by Organization of Health Care?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OrganizationOfHealthCare> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Server?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Server>. }"
},
{
	"question": "What are components of Business Reference Model?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/BusinessReferenceModel> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Orientation?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Orientation>. }"
},
{
	"question": "What has the component Publishing and Presentation?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PublishingAndPresentation>. }"
},
{
	"question": "What has the component Home Care Institution?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/HomeCareInstitution>. }"
},
{
	"question": "What is Architecture of an Information System based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ArchitectureOfAnInformationSystem> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What are components of Qualitative Content Analysis?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/QualitativeContentAnalysis> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of Project?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Project> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component User Requirements Analysis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/UserRequirementsAnalysis>. }"
},
{
	"question": "What has the component 3LGM²-S Service Class?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2SServiceClass>. }"
},
{
	"question": "What has the component Man-Made System?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/ManMadeSystem>. }"
},
{
	"question": "What is Multiple Usability of Data based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MultipleUsabilityOfData> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What has the component Service Strategy?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ServiceStrategy>. }"
},
{
	"question": "What has the component Knowledge about Therapeutic Procedure?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/TherapeuticProcedure>. }"
},
{
	"question": "What has the component Migration Path?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/MigrationPath>. }"
},
{
	"question": "What uses Bed Occupation?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/BedOccupation>. }"
},
{
	"question": "What is based on XML?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/Xml>. }"
},
{
	"question": "What updates Sample?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Sample>. }"
},
{
	"question": "What has the component Catering?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/Catering>. }"
},
{
	"question": "What has the component Hospital Service?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HospitalService>. }"
},
{
	"question": "What has the component Credit Accounting?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/CreditAccounting>. }"
},
{
	"question": "What is Ethernet based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Ethernet> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What is Departmental System Administrator responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DepartmentalSystemAdministrator> <http://www.snik.eu/ontology/meta/isResponsibleForFunction> ?o. }"
},
{
	"question": "What are components of Patient Record Archive?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PatientRecordArchive> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Order?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Order>. }"
},
{
	"question": "What are components of Operational HIS Directing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OperationalHISDirecting> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is updated by Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Management> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What are components of Hospitalâs Board of Directors?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HospitalsBoardOfDirectors> <http://www.snik.eu/ontology/meta/roleComponent> ?o. }"
},
{
	"question": "What has the component HL7 Event Description?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HL7EventDescription>. }"
},
{
	"question": "What updates Key Performance Indicator?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/KeyPerformanceIndicator>. }"
},
{
	"question": "What uses Patient History?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/PatientHistory>. }"
},
{
	"question": "What is increased by ensure contextual integration?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EnsureContextualIntegration> <http://www.snik.eu/ontology/meta/increases> ?o. }"
},
{
	"question": "What is Data Reference Model based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DataReferenceModel> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What is used by ITIL Service Lifecycle?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ItilServiceLifecycle> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What updates ISO 9001?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ISO9001>. }"
},
{
	"question": "What is based on Architectural Style?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/ArchitecturalStyle>. }"
},
{
	"question": "What uses ISO 9001?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ISO9001>. }"
},
{
	"question": "What updates Medical Anamnesis?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/MedicalAnamnesis>. }"
},
{
	"question": "What are components of Coding of Diagnoses and Procedures?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/CodingOfDiagnosesAndProcedures> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What is used by Preparation of an Order?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/PreparationOfAnOrder> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component 3LGM²-B?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2B>. }"
},
{
	"question": "What uses Case Mix Index?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/CaseMixIndex>. }"
},
{
	"question": "What uses External Finding?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ExternalFinding>. }"
},
{
	"question": "What has the component 3LGM² Physical Tool Layer?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2PhysicalToolLayer>. }"
},
{
	"question": "What uses Approval to a Study?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ApprovalToAStudy>. }"
},
{
	"question": "What is used by Execution of Diagnostic and Therapeutic Procedures?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ExecutionOfDiagnosticAndTherapeuticProcedures> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What is Physician responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Physician> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "What are components of Procedure Class?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ProcedureClass> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What uses Hospital Cost?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HospitalCost>. }"
},
{
	"question": "What has the component Past Medical History?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/PastMedicalHistory>. }"
},
{
	"question": "What has the component Transfer?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Transfer>. }"
},
{
	"question": "What has the component Process Controlling?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ProcessControlling>. }"
},
{
	"question": "What uses Complaint?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Complaint>. }"
},
{
	"question": "What updates Approval to a Study?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/ApprovalToAStudy>. }"
},
{
	"question": "What has the component Study Exploration?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/StudyExploration>. }"
},
{
	"question": "What are components of HL7 Version 2?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HL7Version2> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of Operational Information Management?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OperationalInformationManagement> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What has the component Strategic HIS Directing?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/StrategicHISDirecting>. }"
},
{
	"question": "Who is responsible for  Standardization by CEN?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/StandardizationByCEN>. }"
},
{
	"question": "Who is responsible for  Patient?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/Patient>. }"
},
{
	"question": "What has the component UML Association Class?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/UmlAssociationClass>. }"
},
{
	"question": "What uses Workstation?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Workstation>. }"
},
{
	"question": "What is updated by Decision Making and Patient Information?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DecisionMakingAndPatientInformation> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What uses Resource?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Resource>. }"
},
{
	"question": "What is updated by Administrative Discharge and Billing?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/AdministrativeDischargeAndBilling> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "Who is responsible for  Availability of Application Components?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> <http://www.snik.eu/ontology/bb/AvailabilityOfApplicationComponents>. }"
},
{
	"question": "What is updated by Controlling?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Controlling> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What is updated by Archiving?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Archiving> <http://www.snik.eu/ontology/meta/updates> ?o. }"
},
{
	"question": "What has the component Network Monitoring?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/NetworkMonitoring>. }"
},
{
	"question": "What is used by Scheduling and Resource Planning with the Patient Transport Service?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/SchedulingAndResourcePlanningWithThePatientTransportService> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What uses Bed?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Bed>. }"
},
{
	"question": "What has the component Chief Information Officer?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/roleComponent> <http://www.snik.eu/ontology/bb/ChiefInformationOfficer>. }"
},
{
	"question": "What are components of 3LGMÂ²?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/3LGM2> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of Health Care Network?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HealthCareNetwork> <http://www.snik.eu/ontology/meta/roleComponent> ?o. }"
},
{
	"question": "What is Network based on?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Network> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"
},
{
	"question": "What updates Backbone?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Backbone>. }"
},
{
	"question": "What are components of 3LGMÂ² Information Process?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/3LGM2InformationProcess> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What uses Patient?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Patient>. }"
},
{
	"question": "What has the component Patient Identification and Checking for Recurrent?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PatientIdentificationAndCheckingForRecurrent>. }"
},
{
	"question": "What is used by Opening a Patient Record?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OpeningAPatientRecord> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Configuration Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ConfigurationManagement>. }"
},
{
	"question": "What are components of Service Catalog?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ServiceCatalog> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of Event Counting Study?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EventCountingStudy> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What is used by Quality Assessment?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/QualityAssessment> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Problem Management?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ProblemManagement>. }"
},
{
	"question": "What has the component Medical Admission?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/MedicalAdmission>. }"
},
{
	"question": "What is used by Operational HIS Monitoring?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/OperationalHISMonitoring> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component Coding of Procedures?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/CodingOfProcedures>. }"
},
{
	"question": "What are components of SAN?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StorageAreaNetwork> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of SOA?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Soa> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What are components of Controlling Report?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ControllingReport> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What uses Patient Record?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/PatientRecord>. }"
},
{
	"question": "What uses Administrative Patient Data?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/AdministrativePatientData>. }"
},
{
	"question": "What updates Project?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Project>. }"
},
{
	"question": "What has the component Finding?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Finding>. }"
},
{
	"question": "What has the component Administration and Allocation of Patient Records?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/AdministrationAndAllocationOfPatientRecords>. }"
},
{
	"question": "What is Chief Information Officer responsible for ?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ChiefInformationOfficer> <http://www.snik.eu/ontology/meta/isResponsibleForEntityType> ?o. }"
},
{
	"question": "What is used by Visitor and Information Service?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/VisitorAndInformationService> <http://www.snik.eu/ontology/meta/uses> ?o. }"
},
{
	"question": "What has the component HL7 Event Type?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/HL7EventType>. }"
},
{
	"question": "What are components of Decision Making Planning and Organization of Patient Treatment?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DecisionMakingPlanningAndOrganizationOfPatientTreatment> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"
},
{
	"question": "What are components of Storage Area Network?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/StorageAreaNetwork> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Decision Making Planning and Organization of Patient Treatment?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/DecisionMakingPlanningAndOrganizationOfPatientTreatment>. }"
},
{
	"question": "What increases HIS Quality?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/increases> <http://www.snik.eu/ontology/bb/HisQuality>. }"
},
{
	"question": "What has the component Incident Taking?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/IncidentTaking>. }"
},
{
	"question": "What has the component Patient History?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/PatientHistory>. }"
},
{
	"question": "What has the component 3LGM² Entity Type?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/3LGM2EntityType>. }"
},
{
	"question": "What has the component Medical Discharge and Medical Report Writing?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/MedicalDischargeAndMedicalReportWriting>. }"
},
{
	"question": "What uses Order?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Order>. }"
},
{
	"question": "What uses Hospital's Service?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HospitalService>. }"
},
{
	"question": "What are components of Reference Model for the Domain Layer of Hospital Information Systems?",
	"answer": "SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ReferenceModelForTheDomainLayerOfHospitalInformationSystems> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"
},
{
	"question": "What has the component Permanent Monitoring?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PermanentMonitoring>. }"
},
{
	"question": "What has the component Patient Insurance Data?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/PatientInsuranceData>. }"
},
{
	"question": "What uses Application Component?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/ApplicationComponent>. }"
},
{
	"question": "What has the component Directive for HIS Construction?",
	"answer": "SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DirectiveForHISConstruction>. }"
}]