Frage,Anzahl Trainingsfragen,Richtige Antwort,QAnswer-Antwort,Confidence,Precision,Recall,F-Score,Richtige Anzahl,QAnswer Anzahl,Schnittmenge
What is 3LGM2?,0,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT ?s0  WHERE { 		VALUES ?s0 { <http://www.snik.eu/ontology/bb/3LGM2> }  },0.79,0,0.0,0,1,1, 0
What is 3LGM2?,10,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.51,0,0.0,0,1,3, 0
What is 3LGM2?,20,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.49,0,0.0,0,1,3, 0
What is 3LGM2?,30,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.45,0,0.0,0,1,3, 0
What is 3LGM2?,40,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.35,0,0.0,0,1,3, 0
What is 3LGM2?,50,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.36,0,0.0,0,1,3, 0
What is 3LGM2?,60,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.47,0,0.0,0,1,3, 0
What is 3LGM2?,70,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.66,0,0.0,0,1,3, 0
What is 3LGM2?,90,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.58,0,0.0,0,1,3, 0
What is 3LGM2?,100,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.43,0,0.0,0,1,3, 0
What is 3LGM2?,110,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.31,0,0.0,0,1,3, 0
What is 3LGM2?,120,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.27,0,0.0,0,1,3, 0
What is 3LGM2?,130,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.38,0,0.0,0,1,3, 0
What is 3LGM2?,140,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.32,0,0.0,0,1,3, 0
What is 3LGM2?,150,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.4,0,0.0,0,1,3, 0
What is 3LGM2?,160,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.39,0,0.0,0,1,3, 0
What is 3LGM2?,180,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.5,0,0.0,0,1,3, 0
What is 3LGM2?,200,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.46,0,0.0,0,1,3, 0
What is 3LGM2?,230,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.44,0,0.0,0,1,3, 0
What is 3LGM2?,240,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.25,0,0.0,0,1,3, 0
What is 3LGM2?,270,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.41,0,0.0,0,1,3, 0
What is 3LGM2?,280,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.3,0,0.0,0,1,3, 0
What is 3LGM2?,310,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.48,0,0.0,0,1,3, 0
What is 3LGM2?,350,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.34,0,0.0,0,1,3, 0
What is 3LGM2?,370,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.57,0,0.0,0,1,3, 0
What is 3LGM2?,410,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.55,0,0.0,0,1,3, 0
What is 3LGM2?,440,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.33,0,0.0,0,1,3, 0
What is 3LGM2?,450,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.37,0,0.0,0,1,3, 0
What is 3LGM2?,530,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.42,0,0.0,0,1,3, 0
What is 3LGM2?,650,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.61,0,0.0,0,1,3, 0
What is 3LGM2?,770,SELECT DISTINCT ?o1 WHERE { VALUES ?o1 { bb:3LMG2 } . },SELECT DISTINCT ?s1 WHERE { 	 ?s1  <http://www.w3.org/2000/01/rdf-schema#subClassOf>  <http://www.snik.eu/ontology/bb/3LGM2> .  }  LIMIT 1000,0.28,0,0.0,0,1,3, 0
