[
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?s1 WHERE { ?s1 <http://www.w3.org/2000/01/rdf-schema#subClassOf> <http://snik.eu/ontology/bb/Model> . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?o1 WHERE {VALUES ?o1 {<http://snik.eu/ontology/bb/InformationManagement> } . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?s1 WHERE { ?s1 <http://www.w3.org/2000/01/rdf-schema#subClassOf> <http://snik.eu/ontology/bb/Metamodel> . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?s1 WHERE { ?s1 <http://www.w3.org/2000/01/rdf-schema#subClassOf> <http://snik.eu/ontology/bb/HisArchitecture> . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?s1 WHERE { ?s1 <http://www.w3.org/2000/01/rdf-schema#subClassOf> <http://snik.eu/ontology/bb/EhrStrategy> . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?s1 WHERE { <http://snik.eu/ontology/bb/HisQuality> <http://snik.eu/ontology/meta/entityTypeComponent> ?o1 . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?s2 WHERE { <http://snik.eu/ontology/bb/QualityOfHISStructures> <http://snik.eu/ontology/meta/entityTypeComponent> ?o1 . ?s2 <http://www.w3.org/2000/01/rdf-schema#subClassOf> ?o1 . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?s1 WHERE { ?s1 <http://www.w3.org/2000/01/rdf-schema#subClassOf> <http://snik.eu/ontology/bb/QualityOfData> . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?s1 WHERE { ?s1 <http://www.w3.org/2000/01/rdf-schema#subClassOf> <http://snik.eu/ontology/bb/QualityOfHISArchitecture> . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?s1 WHERE { ?s1 <http://www.w3.org/2000/01/rdf-schema#subClassOf> <http://snik.eu/ontology/bb/QualityOfHISProcesses> . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?o1 WHERE { <http://snik.eu/ontology/bb/ItEvaluationStudyManagementAndExecution> <http://snik.eu/ontology/meta/functionComponent> ?o1 . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?o1 WHERE { <http://snik.eu/ontology/bb/StrategicHISPlanning> <http://snik.eu/ontology/meta/functionComponent> ?o1 . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?o1 WHERE { <http://snik.eu/ontology/bb/StrategicHISDirecting> <http://snik.eu/ontology/meta/functionComponent> ?o1 . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?s1 WHERE { ?s1 <http://snik.eu/ontology/meta/isResponsibleForFunction> <http://snik.eu/ontology/bb/InformationManagement> . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?s1 WHERE { ?s1 <http://www.w3.org/2000/01/rdf-schema#subClassOf> <http://snik.eu/ontology/bb/StrategicHISMonitoring> . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?o1 WHERE { <http://snik.eu/ontology/bb/StrategicHISDirecting> <http://snik.eu/ontology/meta/uses> ?o1 . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"sparql": "SELECT DISTINCT ?o1 WHERE { VALUES ?o1 {<http://snik.eu/ontology/bb/HealthCareNetwork> } . }",
	"userName": "kirdie"
}]
