[
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"question": "What are typical metamodels for modeling various aspects of HIS?",
	"correct": true,
	"context":"[]",
	"language": "en",
	"id": 3,
	"sparql": "SELECT DISTINCT ?s1 WHERE { ?s1 rdfs:subClassOf bb:Metamodel . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"question": "What is 3LGM2?",
	"correct": true,
	"context":"[]",
	"language": "en",
	"id": 4,
	"question": "What are the characteristics of the quality of structures in HIS?",
	"correct": true,
	"context":"[]",
	"language": "en",
	"id": 8,
	"sparql": "SELECT DISTINCT ?s2 WHERE { bb:QualityOfHISStructures meta:entityTypeComponent ?o1 . ?s2 rdfs:subClassOf ?o1 . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"question": "What criteria for quality of data exist?",
	"correct": true,
	"context":"[]",
	"language": "en",
	"id": 11,
	"sparql": "SELECT DISTINCT ?s1 WHERE { ?s1 rdfs:subClassOf bb:QualityOfData . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"question": "What are major phases of an IT evaluation study?",
	"correct": true,
	"context":"[]",
	"language": "en",
	"id": 13,
	"sparql": "SELECT DISTINCT ?o1 WHERE { bb:ItEvaluationStudyManagementAndExecution meta:functionComponent ?o1 . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
	"question": "What are the tasks and methods for strategic HIS planning?",
	"correct": true,
	"context":"[]",
	"language": "en",
	"id": 15,
	"sparql": "SELECT DISTINCT ?o1 WHERE { bb:StrategicHISPlanning meta:functionComponent ?o1 . }",
	"userName": "kirdie"
},
{
	"sparqlKB": "SNIK_BB_DRAFT"
	"knowledgebase": "SNIK_BB_DRAFT"
