[{"question":"What is used by Medical and Nursing Care Planning?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/MedicalAndNursingCarePlanning> <http://www.snik.eu/ontology/meta/uses> ?o. }"},{"question":"What is updated by Report and Publication of Study?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ReportAndPublicationOfStudy> <http://www.snik.eu/ontology/meta/updates> ?o. }"},{"question":"What is EN12539 based on?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/EN12539> <http://www.snik.eu/ontology/meta/isBasedOn> ?o. }"},{"question":"What updates Quality Report?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/QualityReport>. }"},{"question":"What has the component Isolation?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Isolation>. }"},{"question":"What has the component DICOM Network Protocol?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DicomNetworkProtocol>. }"},{"question":"What uses Legal Requirement?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/LegalRequirement>. }"},{"question":"What updates Appointment?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Appointment>. }"},{"question":"What are components of UML Class Diagram?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/UmlClassDiagram> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"},{"question":"What is used by Human Resource Management?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HumanResourceManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"},{"question":"What uses Medical Device?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/MedicalDevice>. }"},{"question":"What has the component Description of the Planned HIS State?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DescriptionOfThePlannedHISState>. }"},{"question":"What uses Cost of Treatment?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/CostOfTreatment>. }"},{"question":"What has the component DICOM Service?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DicomService>. }"},{"question":"What has the component Operational HIS Planning?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/OperationalHISPlanning>. }"},{"question":"What uses Joint Commission’s Certification Program?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/JointCommissionsCertificationProgram>. }"},{"question":"What are components of Management of User Accounts?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ManagementOfUserAccounts> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"},{"question":"What updates Notification?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Notification>. }"},{"question":"What decreases Double Examination?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/decreases> <http://www.snik.eu/ontology/bb/DoubleExamination>. }"},{"question":"What has the component Database Server?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DatabaseServer>. }"},{"question":"What is updated by Coding of Procedures?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/CodingOfProcedures> <http://www.snik.eu/ontology/meta/updates> ?o. }"},{"question":"What is increased by HIS Certification?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/HisCertification> <http://www.snik.eu/ontology/meta/increases> ?o. }"},{"question":"What has the component Patient Discharge and Transfer to Other Institutions?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/PatientDischargeAndTransferToOtherInstitutions>. }"},{"question":"What are components of 3LGMÂ²-M?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/3LGM2M> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"},{"question":"What uses HIS Architecture?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HisArchitecture>. }"},{"question":"What updates Human Resource?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/HumanResource>. }"},{"question":"What are components of Tactical Information Management?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TacticalInformationManagement> <http://www.snik.eu/ontology/meta/functionComponent> ?o. }"},{"question":"What are components of Message?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/Message> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"},{"question":"What are components of Discharge Summary?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/DischargeSummary> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"},{"question":"What has the component DICOM Message Format?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DicomMessageFormat>. }"},{"question":"What has the component Discharge Summary?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/DischargeSummary>. }"},{"question":"What uses HIS Component?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/HisComponent>. }"},{"question":"What is updated by Financial Accounting?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/FinancialAccounting> <http://www.snik.eu/ontology/meta/updates> ?o. }"},{"question":"What has the component Nutrition?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/Nutrition>. }"},{"question":"What are components of 2-tier Architecture?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/2TierArchitecture> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"},{"question":"What updates Drug?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/Drug>. }"},{"question":"What has the component Project Planning?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ProjectPlanning>. }"},{"question":"What has the component IT Service Management?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/ItServiceManagement>. }"},{"question":"What updates HIS Benchmarking Method?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/updates> <http://www.snik.eu/ontology/bb/HisBenchmarkingMethod>. }"},{"question":"What is based on Communication Standard?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/CommunicationStandard>. }"},{"question":"What is used by Information Management?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/InformationManagement> <http://www.snik.eu/ontology/meta/uses> ?o. }"},{"question":"What has the component Access Control Management?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/AccessControlManagement>. }"},{"question":"What is based on HL7 Reference Information Model?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isBasedOn> <http://www.snik.eu/ontology/bb/HL7ReferenceInformationModel>. }"},{"question":"What is used by Project Execution?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/ProjectExecution> <http://www.snik.eu/ontology/meta/uses> ?o. }"},{"question":"What has the component Personal Hygiene?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/PersonalHygiene>. }"},{"question":"What has the component UML Association?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/UmlAssociation>. }"},{"question":"What has the component Debtor Accounting?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/functionComponent> <http://www.snik.eu/ontology/bb/DebtorAccounting>. }"},{"question":"What uses Drug?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/uses> <http://www.snik.eu/ontology/bb/Drug>. }"},{"question":"Who is responsible for  Project Conflict Management?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/isResponsibleForFunction> <http://www.snik.eu/ontology/bb/ProjectConflictManagement>. }"},{"question":"What are components of Transinstitutional Health Information System?","answer":"SELECT DISTINCT ?o WHERE { <http://www.snik.eu/ontology/bb/TransinstitutionalHealthInformationSystem> <http://www.snik.eu/ontology/meta/entityTypeComponent> ?o. }"},{"question":"What has the component Nursing Management and Documentation System?","answer":"SELECT DISTINCT ?s WHERE { ?s <http://www.snik.eu/ontology/meta/entityTypeComponent> <http://www.snik.eu/ontology/bb/NursingManagementAndDocumentationSystem>. }"}]